[
  {
    "ruleNumber": 1,
    "sentences": [
      {
        "text": "The NFHS does not perform scientific tests on any specific items of equipment to determine if the equipment poses undue risks to student-athletes, coaches, officials or spectators.",
        "ruleReference": {
          "rule": 1,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "The responsibility for determining if the equipment poses undue risks lies with equipment manufacturers.",
        "ruleReference": {
          "rule": 1,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "The playing court shall be a rectangular surface free from obstructions.",
        "ruleReference": {
          "rule": 1,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "The dimensions of the playing court shall not be greater than 94 feet in length by 50 feet in width.",
        "ruleReference": {
          "rule": 1,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "The ideal measurements for the playing court for high school age are 84 feet in length by 50 feet in width.",
        "ruleReference": {
          "rule": 1,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "Suggestions about construction and lighting are in Diagram 1.",
        "ruleReference": {
          "rule": 1,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "The playing court shall be marked with sidelines, end lines and other lines as shown in Diagram 1.",
        "ruleReference": {
          "rule": 1,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "There shall be at least 3 feet of unobstructed space outside boundaries.",
        "ruleReference": {
          "rule": 1,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "It is preferable to have 10 feet of unobstructed space outside boundaries.",
        "ruleReference": {
          "rule": 1,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "The sidelines and end lines shall be a minimum of 2 inches in width.",
        "ruleReference": {
          "rule": 1,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "If it is desirable to use contrasting colored-floor areas instead of the lines, see Table 1, No. 3.",
        "ruleReference": {
          "rule": 1,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "If, on an unofficial court, there is less than 3 feet of unobstructed space outside any sideline or end line, a narrow broken line shall be marked on the court parallel with and 3 feet inside that boundary.",
        "ruleReference": {
          "rule": 1,
          "section": 2,
          "article": 2
        }
      },
      {
        "text": "The narrow broken line becomes the boundary line during a throw-in on that side or end, as in Rule 7-6.",
        "ruleReference": {
          "rule": 1,
          "section": 2,
          "article": 2
        }
      },
      {
        "text": "The narrow broken line continues to be the boundary until the ball crosses the line.",
        "ruleReference": {
          "rule": 1,
          "section": 2,
          "article": 2
        }
      },
      {
        "text": "A restraining circle shall be drawn at the center of the court with a radius of 6 feet measured to the outside edge.",
        "ruleReference": {
          "rule": 1,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "The edge of the restraining circle shall be designated with a minimum of a ¼-inch-wide single line but no wider than 2 inches.",
        "ruleReference": {
          "rule": 1,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "If the use of contrasting colored-floor areas instead of a line is desirable, see Table 1, No. 3.",
        "ruleReference": {
          "rule": 1,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "Spaces for nonjumpers around the center circle are 36 inches deep.",
        "ruleReference": {
          "rule": 1,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "A division line 2 inches wide shall divide the court into two equal parts.",
        "ruleReference": {
          "rule": 1,
          "section": 3,
          "article": 2
        }
      },
      {
        "text": "If the court is less than 74 feet long, it should be divided by two lines, each parallel to and 40 feet from the farther end line.",
        "ruleReference": {
          "rule": 1,
          "section": 3,
          "article": 2
        }
      },
      {
        "text": "Shadow-bordered lines are permissible.",
        "ruleReference": {
          "rule": 1,
          "section": 3,
          "article": 3
        }
      },
      {
        "text": "A shadow line is a line that designates the required width by use of border or outline lines at least ¼-inch wide, which shall lie within the required width.",
        "ruleReference": {
          "rule": 1,
          "section": 3,
          "article": 3
        }
      },
      {
        "text": "Border lines that are the natural color of the court are permissible.",
        "ruleReference": {
          "rule": 1,
          "section": 3,
          "article": 3
        }
      },
      {
        "text": "The area within these lines need not be one color, but the continuous outline shall be clearly visible to the officials.",
        "ruleReference": {
          "rule": 1,
          "section": 3,
          "article": 3
        }
      },
      {
        "text": "If the floor has a logo in the center of the court, that logo should not distract from the visibility of the division line or center circle.",
        "ruleReference": {
          "rule": 1,
          "section": 3,
          "article": 3
        }
      },
      {
        "text": "A three-point line, 2 inches wide in the form of a semicircle, shall be drawn at each end of the court as shown in Diagram 1.",
        "ruleReference": {
          "rule": 1,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "The semicircle has a radius of 19 feet 9 inches from a point in the middle of the free-throw lane directly below the center of the basket to the outside edge of the line.",
        "ruleReference": {
          "rule": 1,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "The semicircle shall be extended with a 2-inch wide line perpendicular to the end line, the length of which shall be 63 inches from the inside edge of the end line.",
        "ruleReference": {
          "rule": 1,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "The three-point line shall be the same color as the free-throw lane boundary lines and free-throw semicircle.",
        "ruleReference": {
          "rule": 1,
          "section": 4,
          "article": 2
        }
      },
      {
        "text": "A free-throw lane, 12 feet wide measured to the outside of each lane boundary, shall be marked at each end of the court with dimensions and markings as shown in Diagram 1.",
        "ruleReference": {
          "rule": 1,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "All lines designating the free-throw lane, but not lane-space marks are part of the lane.",
        "ruleReference": {
          "rule": 1,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "The lane-space marks (2 inches by 8 inches) identify areas which extend 36 inches from the outer edge of the lane lines toward the sidelines.",
        "ruleReference": {
          "rule": 1,
          "section": 5,
          "article": 2
        }
      },
      {
        "text": "There are three lane spaces on each lane boundary line.",
        "ruleReference": {
          "rule": 1,
          "section": 5,
          "article": 2
        }
      },
      {
        "text": "The free-throw lane line and semicircle shall be the same color as the three-point line.",
        "ruleReference": {
          "rule": 1,
          "section": 5,
          "article": 3
        }
      },
      {
        "text": "A free-throw line, 2 inches wide, shall be drawn across both semicircles, which have an outside radius of 6 feet as shown in Diagram 1.",
        "ruleReference": {
          "rule": 1,
          "section": 6,
          "article": 1
        }
      },
      {
        "text": "The free-throw line shall be parallel to the end line and shall have its farthest edge 15 feet from the plane of the face of the backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 6,
          "article": 1
        }
      },
      {
        "text": "The backboards shall be the same size at both ends of the court.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 1
        }
      },
      {
        "text": "The backboard shall be one of three types: (1) a rectangle 6 feet horizontally and 4 feet vertically; or (2) a rectangle 6 feet horizontally and 3½ feet vertically; or (3) a fan-shaped backboard, 54-inches wide and with dimensions as shown in Diagram 2.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 1
        }
      },
      {
        "text": "The 6-foot horizontal and 3½-foot vertical dimensions are recommended for replacement backboards or new installations.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 1
        }
      },
      {
        "text": "Each of the backboards shall be of any rigid material.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 2
        }
      },
      {
        "text": "The front surface of the backboard shall be flat and, unless it is transparent, it shall be white.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 2
        }
      },
      {
        "text": "Tinted glass backboards are prohibited.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 2
        }
      },
      {
        "text": "For the fan-shaped backboard in transparent material, the recurved cut-out at the bottom may be filled in and the ring attached to the front of the backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 2
        }
      },
      {
        "text": "If the backboard is transparent, it shall be marked as follows: A rectangle shall be centered behind the ring and marked by a 2-inch white line.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 3
        }
      },
      {
        "text": "The rectangle shall have outside dimensions of 24 inches horizontally and 18 inches vertically.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 3
        }
      },
      {
        "text": "For the rectangular backboard, the top edge of the backboard shall be level with the ring.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 3
        }
      },
      {
        "text": "For the fan-shaped backboard, the baseline shall be omitted, and the two vertical lines shall be extended to the bottom of the backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 3
        }
      },
      {
        "text": "The rectangular target in a bright orange or black color may be used on a nontransparent backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 3
        }
      },
      {
        "text": "The border of the backboard shall be marked with a white line.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 3
        }
      },
      {
        "text": "The border shall be 3 inches or less in width.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 3
        }
      },
      {
        "text": "Either type backboard may be transparent or nontransparent.",
        "ruleReference": {
          "rule": 1,
          "section": 8,
          "article": 1
        }
      },
      {
        "text": "No logo, marking, lettering, etc., is permitted on the backboard, backboard padding, or basket.",
        "ruleReference": {
          "rule": 1,
          "section": 8,
          "article": 1
        }
      },
      {
        "text": "Each backboard shall be midway between the sidelines.",
        "ruleReference": {
          "rule": 1,
          "section": 8,
          "article": 2
        }
      },
      {
        "text": "The plane of the front face of each backboard shall be perpendicular to the floor and parallel to the end line.",
        "ruleReference": {
          "rule": 1,
          "section": 8,
          "article": 2
        }
      },
      {
        "text": "Each backboard shall be 4 feet from the end line.",
        "ruleReference": {
          "rule": 1,
          "section": 8,
          "article": 2
        }
      },
      {
        "text": "The upper edge of the backboard shall be 13 feet above the floor for the rectangular backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 8,
          "article": 2
        }
      },
      {
        "text": "The upper edge of the backboard shall be 12 feet 8 inches above the floor for the fan-shaped backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 8,
          "article": 2
        }
      },
      {
        "text": "The backboard shall be protected from spectators to a distance of at least 3 feet at each end.",
        "ruleReference": {
          "rule": 1,
          "section": 8,
          "article": 2
        }
      },
      {
        "text": "The bottom and each side of all rectangular backboards shall be padded with a poly high-carb vinyl-type material that meets the Bashor resilience test with a range of 20-30.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "The padding shall cover the bottom surface of the board and the side surface to a distance of 15 inches up from the bottom.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "The front and back surfaces of the backboard shall be covered to a minimum distance of ¾ inch from the bottom of the backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "The padding shall be 1 inch thick from the front and back surfaces of the backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "The material shall be 2 inches from the bottom edge of the backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "It is recommended that the padding be mounted on the backboard by adhesive or material such as Velcro, channel, etc.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "The padding shall be a single, solid color and shall be the same color on both backboards.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "Any backboard support behind the backboard and at a height of less than 9 feet above the floor shall be padded on the bottom surface to a distance of 2 feet from the face of the backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 2
        }
      },
      {
        "text": "All portable backstops shall have the bases padded to a height of 7 feet on the court-side surface.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 2
        }
      },
      {
        "text": "All support systems should be at least 8 feet behind the plane of the backboard face and at a height of 7 feet or more above the floor.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 3
        }
      },
      {
        "text": "Any backboard support, all of which is not directly behind the backboard, should be at least 6 inches behind it if the support extends above the top and at least 2 feet behind it if the support extends beyond the side.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 4
        }
      },
      {
        "text": "Any overhead backboard support structure which shall be forward-braced due to space limitations, architectural or structural restraints, shall meet the following requirements: A front, diagonal-brace system shall be located above a line extending upward and into the playing court at a maximum 45-degree angle from a point on a vertical line located a minimum of 6 inches behind the front side of the backboard at a minimum height of 4 feet 6 inches above the basket ring.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 4
        }
      },
      {
        "text": "Manufacturers and administrators should be aware of an \"extreme-caution\" warning relative to the misuse of portable backstops.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 5
        }
      },
      {
        "text": "A high degree of injury potential and a severe liability problem exists when players or spectators are allowed to hang, sit or stand on the basket ring or backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 5
        }
      },
      {
        "text": "Administrators shall see that this practice is eliminated or that the portable units are lowered at the completion of the game.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 5
        }
      },
      {
        "text": "There is a high risk of severe injury, even death, if this practice is allowed to occur.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 5
        }
      },
      {
        "text": "A recommended warning or inscription such as \"Danger – please do not get on the ring/backboard\" is desirable.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 5
        }
      },
      {
        "text": "Each basket shall consist of a single metal ring, 18 inches in inside diameter, its flange and braces, and a white-cord 12-mesh net, 15 to 18 inches in length, suspended from beneath the ring.",
        "ruleReference": {
          "rule": 1,
          "section": 10,
          "article": 1
        }
      },
      {
        "text": "Each ring shall not be more than 5/8 inch in diameter, with the possible addition of small-gauge loops on the bottom edge for attaching a 12-mesh net.",
        "ruleReference": {
          "rule": 1,
          "section": 10,
          "article": 2
        }
      },
      {
        "text": "The ring and its attaching flange and braces shall be bright orange in color.",
        "ruleReference": {
          "rule": 1,
          "section": 10,
          "article": 2
        }
      },
      {
        "text": "The cord of the net shall be not less than 120-thread nor more than 144-thread twine, or plastic material of comparable dimensions with no additional extensions.",
        "ruleReference": {
          "rule": 1,
          "section": 10,
          "article": 3
        }
      },
      {
        "text": "The cord of the net shall be constructed to momentarily check the ball as it passes through.",
        "ruleReference": {
          "rule": 1,
          "section": 10,
          "article": 3
        }
      },
      {
        "text": "Each basket ring shall be securely attached to the backboard/support system with a ring-restraining device.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 1
        }
      },
      {
        "text": "The ring-restraining device shall ensure that the basket stays attached in the event a glass backboard breaks.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 1
        }
      },
      {
        "text": "Each basket ring shall have its upper edge 10 feet above and parallel to the floor.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 1
        }
      },
      {
        "text": "Each basket ring shall be equidistant from the vertical edges of the backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 1
        }
      },
      {
        "text": "The nearest point of the inside edge of the ring shall be 6 inches from the plane of the face of the backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 1
        }
      },
      {
        "text": "Positive-lock breakaway, flex breakaway and fixed rings are legal.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 2
        }
      },
      {
        "text": "Breakaway basket rings shall have rebound characteristics similar to those of fixed rings.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 2
        }
      },
      {
        "text": "The pressure-release mechanism should ensure these characteristics, as well as protect both the ring and backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 2
        }
      },
      {
        "text": "The design of the ring and its construction should ensure player safety.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 2
        }
      },
      {
        "text": "For those rings with a breakaway mechanism, the pressure-release mechanism shall be preset so that rings do not deflect more than ½ inch when subjected to static load of 50 pounds and may be sealed or field adjustable.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 3
        }
      },
      {
        "text": "When released, the positive-lock breakaway ring shall not rotate more than 30 degrees below the original horizontal position.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 3
        }
      },
      {
        "text": "After release and with the load no longer applied, the ring shall return automatically and instantaneously to the original position.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 3
        }
      },
      {
        "text": "It is recommended that schools have the basket rings tested for rules compliance.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 3
        }
      },
      {
        "text": "The ball shall meet the following specifications: a. Its solid color shall be Pantone Matching System (PMS) Orange 151, Red-Orange 173 or Brown 1535.",
        "ruleReference": {
          "rule": 1,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "The ball shall be spherical.",
        "ruleReference": {
          "rule": 1,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "The ball shall have a deeply-pebbled, granulated surface with horizontally shaped panels bonded tightly to the rubber carcass.",
        "ruleReference": {
          "rule": 1,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "The circumference of the ball shall be within a minimum of 29½ inches to a maximum of 30 inches for high school boys competition.",
        "ruleReference": {
          "rule": 1,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "The circumference of the ball shall be within a minimum of 28½ inches to a maximum of 29 inches for high school girls competition.",
        "ruleReference": {
          "rule": 1,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "The weight of the ball shall be within a minimum of 20 ounces to a maximum of 22 ounces for high school boys competition.",
        "ruleReference": {
          "rule": 1,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "The weight of the ball shall be within a minimum of 18 ounces to a maximum of 20 ounces for high school girls competition.",
        "ruleReference": {
          "rule": 1,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "The black rubber rib separating the panels shall not exceed ¼ inch in width.",
        "ruleReference": {
          "rule": 1,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "The ball shall include the NFHS Authenticating Mark.",
        "ruleReference": {
          "rule": 1,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "The NFHS Authenticating Mark can be displayed in either format shown in Diagram 3.",
        "ruleReference": {
          "rule": 1,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "A current list of NFHS authenticated products can be found on the website, nfhs.org, under \"Resources.\"",
        "ruleReference": {
          "rule": 1,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "The ball shall be inflated to an air pressure such that when it is dropped to the playing surface from a height of 6 feet, measured to the bottom of the ball, it shall rebound to a height, measured to the top of the ball, of not less than 49 inches when it strikes on its least resilient spot, nor more than 54 inches when it strikes on its most resilient spot.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 2
        }
      },
      {
        "text": "To be legal, the air pressure which will give the required reaction shall be stamped on the ball.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 2
        }
      },
      {
        "text": "The pressure for game use shall make the ball bounce legally.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 2
        }
      },
      {
        "text": "The home team shall provide a ball which meets the specifications.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 3
        }
      },
      {
        "text": "The referee shall be the sole judge of the legality of the ball and may select a ball provided by the visiting team.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 3
        }
      },
      {
        "text": "The location of each team's bench shall be designated by game management.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 1
        }
      },
      {
        "text": "It is recommended that the benches for team members and coaches of both teams be placed along that side of the court on which the scorer's and timer's table is located.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 1
        }
      },
      {
        "text": "The coaching box shall be outlined outside the side of the court on which the scorer's and timer's table and team benches are located.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 2
        }
      },
      {
        "text": "The coaching box area shall be bounded by a line drawn 28 feet from the end line towards the division line.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 2
        }
      },
      {
        "text": "A line, perpendicular to the 28-foot line and placed at each end, with a minimum length of 2 feet, shall be extended toward the team bench so that the coaching box boundary is evident.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 2
        }
      },
      {
        "text": "These lines shall be located off the court and be 2 inches wide.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 2
        }
      },
      {
        "text": "The same directions should be followed for the other side of the scorer's and timer's table.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 2
        }
      },
      {
        "text": "State associations may alter the length and placement of the 28-foot (maximum) coaching box.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 2
        }
      },
      {
        "text": "The time-out area shall be the area inside an imaginary rectangle formed by the boundaries of the sideline (including the bench), end line, and an imaginary line extended from the free-throw lane line nearest the bench area meeting an imaginary line extended from the coaching-box line.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 3
        }
      },
      {
        "text": "A red light behind each backboard or an LED light on each backboard is permitted to signal that time has expired for a quarter or extra period.",
        "ruleReference": {
          "rule": 1,
          "section": 14,
          "article": 1
        }
      },
      {
        "text": "In facilities without a red light behind or an LED light on each backboard, the audible timer's signal shall indicate that time has expired.",
        "ruleReference": {
          "rule": 1,
          "section": 14,
          "article": 1
        }
      },
      {
        "text": "A visible game clock and scoreboard are mandatory.",
        "ruleReference": {
          "rule": 1,
          "section": 15,
          "article": 1
        }
      },
      {
        "text": "An alternate timing device and scoring information system shall be available in the event of malfunction.",
        "ruleReference": {
          "rule": 1,
          "section": 15,
          "article": 1
        }
      },
      {
        "text": "A visible display shall be located at the scorer's and timer's table to indicate team possession for the alternating-possession procedure.",
        "ruleReference": {
          "rule": 1,
          "section": 16,
          "article": 1
        }
      },
      {
        "text": "An \"X\" 12 inches long and 2 inches wide shall be placed on the floor out of bounds directly in front of the official scorer to help substitutes with the proper location.",
        "ruleReference": {
          "rule": 1,
          "section": 17,
          "article": 1
        }
      },
      {
        "text": "The playing of music/sound effects shall only be permitted during pregame, time-outs, intermission and post-game.",
        "ruleReference": {
          "rule": 1,
          "section": 18,
          "article": 1
        }
      },
      {
        "text": "The use of artificial noisemakers shall be prohibited.",
        "ruleReference": {
          "rule": 1,
          "section": 18,
          "article": 1
        }
      },
      {
        "text": "The announcer shall be prohibited from making announcements during the game, such as \"two minutes to go.\"",
        "ruleReference": {
          "rule": 1,
          "section": 18,
          "article": 1
        }
      },
      {
        "text": "The use of electronic devices is permitted during the game.",
        "ruleReference": {
          "rule": 1,
          "section": 19,
          "article": 1
        }
      },
      {
        "text": "Non-playing personnel, e.g., spirit participants, media, shall remain outside of the playing area during a 30-second time-out.",
        "ruleReference": {
          "rule": 1,
          "section": 20,
          "article": 1
        }
      },
      {
        "text": "Non-playing personnel shall be located outside the free-throw lane lines extended toward the sidelines throughout the game.",
        "ruleReference": {
          "rule": 1,
          "section": 20,
          "article": 1
        }
      }
    ]
  }
]