[
  {
    "ruleNumber": 1,
    "sentences": [
      {
        "text": "The NFHS does not perform scientific tests on any specific items of equipment to determine if the equipment poses undue risks to student-athletes, coaches, officials or spectators.",
        "ruleReference": {
          "rule": 1,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "The responsibility for determining if the equipment poses undue risks lies with equipment manufacturers.",
        "ruleReference": {
          "rule": 1,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "The playing court shall be a rectangular surface free from obstructions.",
        "ruleReference": {
          "rule": 1,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "The dimensions of the playing court shall not be greater than 94 feet in length by 50 feet in width.",
        "ruleReference": {
          "rule": 1,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "The ideal measurements for the playing court for high school age are 84 feet in length by 50 feet in width.",
        "ruleReference": {
          "rule": 1,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "Suggestions about construction and lighting are in Diagram 1.",
        "ruleReference": {
          "rule": 1,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "The playing court shall be marked with sidelines, end lines and other lines as shown in Diagram 1.",
        "ruleReference": {
          "rule": 1,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "There shall be at least 3 feet of unobstructed space outside boundaries of the playing court.",
        "ruleReference": {
          "rule": 1,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "It is preferable to have 10 feet of unobstructed space outside boundaries of the playing court.",
        "ruleReference": {
          "rule": 1,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "The sidelines and end lines shall be a minimum of 2 inches in width.",
        "ruleReference": {
          "rule": 1,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "If it is desirable to use contrasting colored-floor areas instead of the lines, see Table 1, No. 3.",
        "ruleReference": {
          "rule": 1,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "If, on an unofficial court, there is less than 3 feet of unobstructed space outside any sideline or end line, a narrow broken line shall be marked on the court parallel with and 3 feet inside that boundary.",
        "ruleReference": {
          "rule": 1,
          "section": 2,
          "article": 2
        }
      },
      {
        "text": "The narrow broken line becomes the boundary line during a throw-in on that side or end, as in Rule 7-6.",
        "ruleReference": {
          "rule": 1,
          "section": 2,
          "article": 2
        }
      },
      {
        "text": "The narrow broken line continues to be the boundary until the ball crosses the line.",
        "ruleReference": {
          "rule": 1,
          "section": 2,
          "article": 2
        }
      },
      {
        "text": "A restraining circle shall be drawn at the center of the court with a radius of 6 feet measured to the outside edge.",
        "ruleReference": {
          "rule": 1,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "The edge of the restraining circle shall be designated with a minimum of a ¼-inch-wide single line but no wider than 2 inches.",
        "ruleReference": {
          "rule": 1,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "If the use of contrasting colored-floor areas instead of a line is desirable, see Table 1, No. 3.",
        "ruleReference": {
          "rule": 1,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "Spaces for nonjumpers around the center circle are 36 inches deep.",
        "ruleReference": {
          "rule": 1,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "A division line 2 inches wide shall divide the court into two equal parts.",
        "ruleReference": {
          "rule": 1,
          "section": 3,
          "article": 2
        }
      },
      {
        "text": "If the court is less than 74 feet long, it should be divided by two lines, each parallel to and 40 feet from the farther end line.",
        "ruleReference": {
          "rule": 1,
          "section": 3,
          "article": 2
        }
      },
      {
        "text": "Shadow-bordered lines are permissible.",
        "ruleReference": {
          "rule": 1,
          "section": 3,
          "article": 3
        }
      },
      {
        "text": "A shadow line is a line that designates the required width by use of border or outline lines at least ¼-inch wide, which shall lie within the required width.",
        "ruleReference": {
          "rule": 1,
          "section": 3,
          "article": 3
        }
      },
      {
        "text": "Border lines that are the natural color of the court are permissible.",
        "ruleReference": {
          "rule": 1,
          "section": 3,
          "article": 3
        }
      },
      {
        "text": "The area within these lines need not be one color, but the continuous outline shall be clearly visible to the officials.",
        "ruleReference": {
          "rule": 1,
          "section": 3,
          "article": 3
        }
      },
      {
        "text": "If the floor has a logo in the center of the court, that logo should not distract from the visibility of the division line or center circle.",
        "ruleReference": {
          "rule": 1,
          "section": 3,
          "article": 3
        }
      },
      {
        "text": "A three-point line, 2 inches wide in the form of a semicircle, shall be drawn at each end of the court as shown in Diagram 1.",
        "ruleReference": {
          "rule": 1,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "The semicircle has a radius of 19 feet 9 inches from a point in the middle of the free-throw lane directly below the center of the basket to the outside edge of the line.",
        "ruleReference": {
          "rule": 1,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "The semicircle shall be extended with a 2-inch wide line perpendicular to the end line, the length of which shall be 63 inches from the inside edge of the end line.",
        "ruleReference": {
          "rule": 1,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "The three-point line shall be the same color as the free-throw lane boundary lines and free-throw semicircle.",
        "ruleReference": {
          "rule": 1,
          "section": 4,
          "article": 2
        }
      },
      {
        "text": "A free-throw lane, 12 feet wide measured to the outside of each lane boundary, shall be marked at each end of the court with dimensions and markings as shown in Diagram 1.",
        "ruleReference": {
          "rule": 1,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "All lines designating the free-throw lane, but not lane-space marks are part of the lane.",
        "ruleReference": {
          "rule": 1,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "The lane-space marks (2 inches by 8 inches) identify areas which extend 36 inches from the outer edge of the lane lines toward the sidelines.",
        "ruleReference": {
          "rule": 1,
          "section": 5,
          "article": 2
        }
      },
      {
        "text": "There are three lane spaces on each lane boundary line.",
        "ruleReference": {
          "rule": 1,
          "section": 5,
          "article": 2
        }
      },
      {
        "text": "The free-throw lane line and semicircle shall be the same color as the three-point line.",
        "ruleReference": {
          "rule": 1,
          "section": 5,
          "article": 3
        }
      },
      {
        "text": "A free-throw line, 2 inches wide, shall be drawn across both semicircles, which have an outside radius of 6 feet as shown in Diagram 1.",
        "ruleReference": {
          "rule": 1,
          "section": 6,
          "article": 1
        }
      },
      {
        "text": "The free-throw line shall be parallel to the end line and shall have its farthest edge 15 feet from the plane of the face of the backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 6,
          "article": 1
        }
      },
      {
        "text": "The backboards shall be the same size at both ends of the court.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 1
        }
      },
      {
        "text": "The backboard shall be one of three types: (1) a rectangle 6 feet horizontally and 4 feet vertically; or (2) a rectangle 6 feet horizontally and 3½ feet vertically; or (3) a fan-shaped backboard, 54 inches wide and with dimensions as shown in Diagram 2.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 1
        }
      },
      {
        "text": "The 6-foot horizontal and 3½-foot vertical dimensions are recommended for replacement backboards or new installations.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 1
        }
      },
      {
        "text": "Each of the backboards shall be of any rigid material.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 2
        }
      },
      {
        "text": "The front surface of the backboard shall be flat and, unless it is transparent, it shall be white.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 2
        }
      },
      {
        "text": "Tinted glass backboards are prohibited.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 2
        }
      },
      {
        "text": "For the fan-shaped backboard in transparent material, the recurved cut-out at the bottom may be filled in and the ring attached to the front of the backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 2
        }
      },
      {
        "text": "If the backboard is transparent, it shall be marked as follows: A rectangle shall be centered behind the ring and marked by a 2-inch white line.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 3
        }
      },
      {
        "text": "The rectangle shall have outside dimensions of 24 inches horizontally and 18 inches vertically.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 3
        }
      },
      {
        "text": "For the rectangular backboard, the top edge of the backboard shall be level with the ring.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 3
        }
      },
      {
        "text": "For the fan-shaped backboard, the baseline shall be omitted, and the two vertical lines shall be extended to the bottom of the backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 3
        }
      },
      {
        "text": "The rectangular target in a bright orange or black color may be used on a nontransparent backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 3
        }
      },
      {
        "text": "The border of the backboard shall be marked with a white line.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 3
        }
      },
      {
        "text": "The border shall be 3 inches or less in width.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 3
        }
      },
      {
        "text": "Either type backboard may be transparent or nontransparent.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 4
        }
      },
      {
        "text": "No logo, marking, lettering, etc., is permitted on the backboard, backboard padding, or basket.",
        "ruleReference": {
          "rule": 1,
          "section": 7,
          "article": 4
        }
      },
      {
        "text": "Each backboard shall be midway between the sidelines.",
        "ruleReference": {
          "rule": 1,
          "section": 8,
          "article": 1
        }
      },
      {
        "text": "The plane of the front face of each backboard shall be perpendicular to the floor and parallel to the end line.",
        "ruleReference": {
          "rule": 1,
          "section": 8,
          "article": 1
        }
      },
      {
        "text": "Each backboard shall be 4 feet from the end line.",
        "ruleReference": {
          "rule": 1,
          "section": 8,
          "article": 1
        }
      },
      {
        "text": "The upper edge of the backboard shall be 13 feet above the floor for the rectangular backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 8,
          "article": 2
        }
      },
      {
        "text": "The upper edge of the backboard shall be 12 feet 8 inches above the floor for the fan-shaped backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 8,
          "article": 2
        }
      },
      {
        "text": "The backboard shall be protected from spectators to a distance of at least 3 feet at each end.",
        "ruleReference": {
          "rule": 1,
          "section": 8,
          "article": 2
        }
      },
      {
        "text": "The bottom and each side of all rectangular backboards shall be padded with a poly high-carb vinyl-type material that meets the Bashor resilience test with a range of 20-30.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "The padding shall cover the bottom surface of the board and the side surface to a distance of 15 inches up from the bottom.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "The front and back surfaces of the backboard shall be covered to a minimum distance of ¾ inch from the bottom of the backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "The padding shall be 1 inch thick from the front and back surfaces of the backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "The material shall be 2 inches from the bottom edge of the backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "It is recommended that the padding be mounted on the backboard by adhesive or material such as Velcro, channel, etc.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "The padding shall be a single, solid color and shall be the same color on both backboards.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "Any backboard support behind the backboard and at a height of less than 9 feet above the floor shall be padded on the bottom surface to a distance of 2 feet from the face of the backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 2
        }
      },
      {
        "text": "All portable backstops shall have the bases padded to a height of 7 feet on the court-side surface.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 2
        }
      },
      {
        "text": "All support systems should be at least 8 feet behind the plane of the backboard face and at a height of 7 feet or more above the floor.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 3
        }
      },
      {
        "text": "Any backboard support, all of which is not directly behind the backboard, should be at least 6 inches behind it if the support extends above the top and at least 2 feet behind it if the support extends beyond the side.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 4
        }
      },
      {
        "text": "Any overhead backboard support structure which shall be forward-braced due to space limitations, architectural or structural restraints, shall meet specific requirements.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 4
        }
      },
      {
        "text": "A front, diagonal-brace system shall be located above a line extending upward and into the playing court at a maximum 45-degree angle from a point on a vertical line located a minimum of 6 inches behind the front side of the backboard at a minimum height of 4 feet 6 inches above the basket ring.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 4
        }
      },
      {
        "text": "Manufacturers and administrators should be aware of an \"extreme-caution\" warning relative to the misuse of portable backstops.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 5
        }
      },
      {
        "text": "A high degree of injury potential and a severe liability problem exists when players or spectators are allowed to hang, sit or stand on the basket ring or backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 5
        }
      },
      {
        "text": "Administrators shall see that this practice is eliminated or that the portable units are lowered at the completion of the game.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 5
        }
      },
      {
        "text": "There is a high risk of severe injury, even death, if this practice is allowed to occur.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 5
        }
      },
      {
        "text": "A recommended warning or inscription such as \"Danger – please do not get on the ring/backboard\" is desirable.",
        "ruleReference": {
          "rule": 1,
          "section": 9,
          "article": 5
        }
      },
      {
        "text": "Each basket shall consist of a single metal ring, 18 inches in inside diameter, its flange and braces, and a white-cord 12-mesh net, 15 to 18 inches in length, suspended from beneath the ring.",
        "ruleReference": {
          "rule": 1,
          "section": 10,
          "article": 1
        }
      },
      {
        "text": "Each ring shall not be more than 5/8 inch in diameter, with the possible addition of small-gauge loops on the bottom edge for attaching a 12-mesh net.",
        "ruleReference": {
          "rule": 1,
          "section": 10,
          "article": 2
        }
      },
      {
        "text": "The ring and its attaching flange and braces shall be bright orange in color.",
        "ruleReference": {
          "rule": 1,
          "section": 10,
          "article": 2
        }
      },
      {
        "text": "The cord of the net shall be not less than 120-thread nor more than 144-thread twine, or plastic material of comparable dimensions with no additional extensions.",
        "ruleReference": {
          "rule": 1,
          "section": 10,
          "article": 3
        }
      },
      {
        "text": "The net shall be constructed to momentarily check the ball as it passes through.",
        "ruleReference": {
          "rule": 1,
          "section": 10,
          "article": 3
        }
      },
      {
        "text": "Each basket ring shall be securely attached to the backboard/support system with a ring-restraining device.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 1
        }
      },
      {
        "text": "The ring-restraining device shall ensure that the basket stays attached in the event a glass backboard breaks.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 1
        }
      },
      {
        "text": "Each basket ring shall have its upper edge 10 feet above and parallel to the floor.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 1
        }
      },
      {
        "text": "Each basket ring shall be equidistant from the vertical edges of the backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 1
        }
      },
      {
        "text": "The nearest point of the inside edge of the ring shall be 6 inches from the plane of the face of the backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 1
        }
      },
      {
        "text": "Positive-lock breakaway, flex breakaway and fixed rings are legal.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 2
        }
      },
      {
        "text": "Breakaway basket rings shall have rebound characteristics similar to those of fixed rings.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 2
        }
      },
      {
        "text": "The pressure-release mechanism should ensure these characteristics, as well as protect both the ring and backboard.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 2
        }
      },
      {
        "text": "The design of the ring and its construction should ensure player safety.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 2
        }
      },
      {
        "text": "For those rings with a breakaway mechanism, the pressure-release mechanism shall be preset so that rings do not deflect more than ½ inch when subjected to static load of 50 pounds and may be sealed or field adjustable.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 3
        }
      },
      {
        "text": "When released, the positive-lock breakaway ring shall not rotate more than 30 degrees below the original horizontal position.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 3
        }
      },
      {
        "text": "After release and with the load no longer applied, the ring shall return automatically and instantaneously to the original position.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 3
        }
      },
      {
        "text": "It is recommended that schools have the basket rings tested for rules compliance.",
        "ruleReference": {
          "rule": 1,
          "section": 11,
          "article": 3
        }
      },
      {
        "text": "The ball shall meet specific specifications.",
        "ruleReference": {
          "rule": 1,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "The solid color of the ball shall be Pantone Matching System (PMS) Orange 151, Red-Orange 173 or Brown 1535.",
        "ruleReference": {
          "rule": 1,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "The ball shall be spherical.",
        "ruleReference": {
          "rule": 1,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "The ball shall have a deeply-pebbled, granulated surface with horizontally shaped panels bonded tightly to the rubber carcass.",
        "ruleReference": {
          "rule": 1,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "The circumference of the ball shall be within a minimum of 29½ inches to a maximum of 30 inches for high school boys competition.",
        "ruleReference": {
          "rule": 1,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "The circumference of the ball shall be within a minimum of 28½ inches to a maximum of 29 inches for high school girls competition.",
        "ruleReference": {
          "rule": 1,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "The weight of the ball shall be within a minimum of 20 ounces to a maximum of 22 ounces for high school boys competition.",
        "ruleReference": {
          "rule": 1,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "The weight of the ball shall be within a minimum of 18 ounces to a maximum of 20 ounces for high school girls competition.",
        "ruleReference": {
          "rule": 1,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "The black rubber rib separating the panels shall not exceed ¼ inch in width.",
        "ruleReference": {
          "rule": 1,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "The ball shall include the NFHS Authenticating Mark.",
        "ruleReference": {
          "rule": 1,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "The NFHS Authenticating Mark can be displayed in either format shown in Diagram 3.",
        "ruleReference": {
          "rule": 1,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "A current list of NFHS authenticated products can be found on the website, nfhs.org, under \"Resources.\"",
        "ruleReference": {
          "rule": 1,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "The ball shall be inflated to an air pressure such that when it is dropped to the playing surface from a height of 6 feet, it shall rebound to a height of not less than 49 inches when it strikes on its least resilient spot, nor more than 54 inches when it strikes on its most resilient spot.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 2
        }
      },
      {
        "text": "To be legal, the air pressure which will give the required reaction shall be stamped on the ball.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 2
        }
      },
      {
        "text": "The pressure for game use shall make the ball bounce legally.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 2
        }
      },
      {
        "text": "The home team shall provide a ball which meets the specifications.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 3
        }
      },
      {
        "text": "The referee shall be the sole judge of the legality of the ball and may select a ball provided by the visiting team.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 3
        }
      },
      {
        "text": "The location of each team's bench shall be designated by game management.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 1
        }
      },
      {
        "text": "It is recommended that the benches for team members and coaches of both teams be placed along that side of the court on which the scorer's and timer's table is located.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 1
        }
      },
      {
        "text": "The coaching box shall be outlined outside the side of the court on which the scorer's and timer's table and team benches are located.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 2
        }
      },
      {
        "text": "The coaching box area shall be bounded by a line drawn 28 feet from the end line towards the division line.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 2
        }
      },
      {
        "text": "A line, perpendicular to the 28-foot line and placed at each end, with a minimum length of 2 feet, shall be extended toward the team bench so that the coaching box boundary is evident.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 2
        }
      },
      {
        "text": "These lines shall be located off the court and be 2 inches wide.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 2
        }
      },
      {
        "text": "The same directions should be followed for the other side of the scorer's and timer's table.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 2
        }
      },
      {
        "text": "State associations may alter the length and placement of the 28-foot (maximum) coaching box.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 2
        }
      },
      {
        "text": "The time-out area shall be the area inside an imaginary rectangle formed by the boundaries of the sideline (including the bench), end line, and an imaginary line extended from the free-throw lane line nearest the bench area meeting an imaginary line extended from the coaching-box line.",
        "ruleReference": {
          "rule": 1,
          "section": 13,
          "article": 3
        }
      },
      {
        "text": "A red light behind each backboard or an LED light on each backboard is permitted to signal that time has expired for a quarter or extra period.",
        "ruleReference": {
          "rule": 1,
          "section": 14,
          "article": 1
        }
      },
      {
        "text": "In facilities without a red light behind or an LED light on each backboard, the audible timer's signal shall indicate that time has expired.",
        "ruleReference": {
          "rule": 1,
          "section": 14,
          "article": 1
        }
      },
      {
        "text": "A visible game clock and scoreboard are mandatory.",
        "ruleReference": {
          "rule": 1,
          "section": 15,
          "article": 1
        }
      },
      {
        "text": "An alternate timing device and scoring information system shall be available in the event of malfunction.",
        "ruleReference": {
          "rule": 1,
          "section": 15,
          "article": 1
        }
      },
      {
        "text": "A visible display shall be located at the scorer's and timer's table to indicate team possession for the alternating-possession procedure.",
        "ruleReference": {
          "rule": 1,
          "section": 16,
          "article": 1
        }
      },
      {
        "text": "An \"X\" 12 inches long and 2 inches wide shall be placed on the floor out of bounds directly in front of the official scorer to help substitutes with the proper location.",
        "ruleReference": {
          "rule": 1,
          "section": 17,
          "article": 1
        }
      },
      {
        "text": "The playing of music/sound effects shall only be permitted during pregame, time-outs, intermission and post-game.",
        "ruleReference": {
          "rule": 1,
          "section": 18,
          "article": 1
        }
      },
      {
        "text": "The use of artificial noisemakers shall be prohibited.",
        "ruleReference": {
          "rule": 1,
          "section": 18,
          "article": 1
        }
      },
      {
        "text": "The announcer shall be prohibited from making announcements during the game, such as \"two minutes to go.\"",
        "ruleReference": {
          "rule": 1,
          "section": 18,
          "article": 1
        }
      },
      {
        "text": "The use of electronic devices is permitted during the game.",
        "ruleReference": {
          "rule": 1,
          "section": 19,
          "article": 1
        }
      },
      {
        "text": "Non-playing personnel, e.g., spirit participants, media, shall remain outside of the playing area during a 30-second time-out.",
        "ruleReference": {
          "rule": 1,
          "section": 20,
          "article": 1
        }
      },
      {
        "text": "Non-playing personnel shall be located outside the free-throw lane lines extended toward the sidelines throughout the game.",
        "ruleReference": {
          "rule": 1,
          "section": 20,
          "article": 1
        }
      }
    ]
  },
  {
    "ruleNumber": 2,
    "sentences": [
      {
        "text": "The official's uniform shall be a black-and-white striped shirt, black pants, predominantly black shoes and black socks.",
        "ruleReference": {
          "rule": 2,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "The game officials shall be a referee and an umpire or a referee and two umpires.",
        "ruleReference": {
          "rule": 2,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "The game officials shall be assisted by an official timer and scorer.",
        "ruleReference": {
          "rule": 2,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "The scorer and timer shall be located at the scorer's and timer's table on the side of the court.",
        "ruleReference": {
          "rule": 2,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "It is recommended that the official scorer and timer be seated next to each other.",
        "ruleReference": {
          "rule": 2,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "If using a shot clock, the operator shall be located at the scorer's and timer's table.",
        "ruleReference": {
          "rule": 2,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "The officials shall make decisions for infractions of the rules committed within or outside the boundary lines.",
        "ruleReference": {
          "rule": 2,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "The use of any replay or television monitoring equipment by the officials in making any decision relating to the game is prohibited.",
        "ruleReference": {
          "rule": 2,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "A state association may permit game or replay officials to use a replay monitor during state championship series contests.",
        "ruleReference": {
          "rule": 2,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "The replay monitor may be used to determine if a scored goal at the expiration of time in the fourth quarter or any overtime period should be counted.",
        "ruleReference": {
          "rule": 2,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "The replay monitor may also be used to determine if the scored goal is a two-point or a three-point goal.",
        "ruleReference": {
          "rule": 2,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "The officials' jurisdiction begins when the officials arrive on the floor.",
        "ruleReference": {
          "rule": 2,
          "section": 2,
          "article": 2
        }
      },
      {
        "text": "The officials' arrival on the floor shall be at least 15 minutes before the scheduled starting time of the game.",
        "ruleReference": {
          "rule": 2,
          "section": 2,
          "article": 2
        }
      },
      {
        "text": "The officials' jurisdiction extends through periods when the game may be momentarily stopped for any reason.",
        "ruleReference": {
          "rule": 2,
          "section": 2,
          "article": 3
        }
      },
      {
        "text": "The jurisdiction of the officials is terminated when all officials leave the visual confines of the playing area.",
        "ruleReference": {
          "rule": 2,
          "section": 2,
          "article": 4
        }
      },
      {
        "text": "The final score has been approved when all officials leave the visual confines of the playing area.",
        "ruleReference": {
          "rule": 2,
          "section": 2,
          "article": 4
        }
      },
      {
        "text": "The officials retain clerical authority over the contest through the completion of any reports, including those imposing disqualifications, which are responsive to actions occurring while the officials had jurisdiction.",
        "ruleReference": {
          "rule": 2,
          "section": 2,
          "article": 4
        }
      },
      {
        "text": "State associations may intercede in the event of unusual incidents that occur before, during or after the officials' jurisdiction has ended.",
        "ruleReference": {
          "rule": 2,
          "section": 2,
          "article": 4
        }
      },
      {
        "text": "The referee shall make decisions on any points not specifically covered in the rules.",
        "ruleReference": {
          "rule": 2,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "The referee shall inspect and approve all equipment, including court, baskets, ball, backboards, and scorer's and timer's signals.",
        "ruleReference": {
          "rule": 2,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "The referee shall designate the official timepiece and official timer prior to the scheduled starting time of the game.",
        "ruleReference": {
          "rule": 2,
          "section": 4,
          "article": 2
        }
      },
      {
        "text": "The referee shall designate the official scorebook and official scorer prior to the scheduled starting time of the game.",
        "ruleReference": {
          "rule": 2,
          "section": 4,
          "article": 3
        }
      },
      {
        "text": "A state association may authorize use of supplementary equipment to aid in game administration.",
        "ruleReference": {
          "rule": 2,
          "section": 4,
          "article": 3
        }
      },
      {
        "text": "The referee shall be responsible for having each team notified three minutes before each half is to begin.",
        "ruleReference": {
          "rule": 2,
          "section": 4,
          "article": 4
        }
      },
      {
        "text": "The referee shall verify with the head coach, prior to each contest, that all team members' uniforms and equipment are legal and will be worn properly.",
        "ruleReference": {
          "rule": 2,
          "section": 4,
          "article": 5
        }
      },
      {
        "text": "The referee shall verify with the head coach, prior to each contest, that all participants will exhibit proper sporting behavior throughout the contest.",
        "ruleReference": {
          "rule": 2,
          "section": 4,
          "article": 5
        }
      },
      {
        "text": "The referee shall designate the official to toss the ball in the center restraining circle for all jump-ball situations.",
        "ruleReference": {
          "rule": 2,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "The referee shall administer the alternating-possession throw-in to start the second, third and fourth quarters.",
        "ruleReference": {
          "rule": 2,
          "section": 5,
          "article": 2
        }
      },
      {
        "text": "The referee shall decide whether a goal shall count if the officials disagree.",
        "ruleReference": {
          "rule": 2,
          "section": 5,
          "article": 3
        }
      },
      {
        "text": "The referee may declare the game a forfeit when conditions warrant.",
        "ruleReference": {
          "rule": 2,
          "section": 5,
          "article": 4
        }
      },
      {
        "text": "The referee shall decide matters upon which the scorer and timer disagree and correct obvious timing errors.",
        "ruleReference": {
          "rule": 2,
          "section": 5,
          "article": 5
        }
      },
      {
        "text": "The referee shall confer with the official scorer at halftime to determine the possession arrow is pointed in the proper direction to begin play in the third quarter.",
        "ruleReference": {
          "rule": 2,
          "section": 5,
          "article": 6
        }
      },
      {
        "text": "The referee shall check and approve the score at the end of each half.",
        "ruleReference": {
          "rule": 2,
          "section": 5,
          "article": 7
        }
      },
      {
        "text": "The referee shall inform each team and the table officials of the overtime procedures when the score is tied at the end of regulation time.",
        "ruleReference": {
          "rule": 2,
          "section": 5,
          "article": 8
        }
      },
      {
        "text": "No official has the authority to set aside or question decisions made by the other official(s) within the limits of their respective outlined duties.",
        "ruleReference": {
          "rule": 2,
          "section": 6,
          "article": 1
        }
      },
      {
        "text": "The officials shall conduct the game in accordance with the rules.",
        "ruleReference": {
          "rule": 2,
          "section": 7,
          "article": 1
        }
      },
      {
        "text": "The officials shall notify the captains when play is about to begin at the start of the game.",
        "ruleReference": {
          "rule": 2,
          "section": 7,
          "article": 1
        }
      },
      {
        "text": "The officials shall put the ball in play.",
        "ruleReference": {
          "rule": 2,
          "section": 7,
          "article": 2
        }
      },
      {
        "text": "The officials shall determine when the ball becomes dead and live.",
        "ruleReference": {
          "rule": 2,
          "section": 7,
          "article": 3
        }
      },
      {
        "text": "The officials shall prohibit practice during a dead ball, except between halves.",
        "ruleReference": {
          "rule": 2,
          "section": 7,
          "article": 4
        }
      },
      {
        "text": "The officials shall administer penalties.",
        "ruleReference": {
          "rule": 2,
          "section": 7,
          "article": 5
        }
      },
      {
        "text": "The officials shall grant and charge time-out.",
        "ruleReference": {
          "rule": 2,
          "section": 7,
          "article": 6
        }
      },
      {
        "text": "The officials shall beckon substitutes to enter the court.",
        "ruleReference": {
          "rule": 2,
          "section": 7,
          "article": 7
        }
      },
      {
        "text": "The officials shall signal a three-point attempt and signal a successful three-point goal.",
        "ruleReference": {
          "rule": 2,
          "section": 7,
          "article": 8
        }
      },
      {
        "text": "The officials shall silently and visibly count seconds to administer the throw-in, free-throw, backcourt and closely-guarded rules.",
        "ruleReference": {
          "rule": 2,
          "section": 7,
          "article": 9
        }
      },
      {
        "text": "The officials shall report a team warning for delay to the official scorer and then to the head coach of the offending team.",
        "ruleReference": {
          "rule": 2,
          "section": 7,
          "article": 10
        }
      },
      {
        "text": "The officials shall report a team warning for head coach/bench personnel misconduct to the official scorer and then to the head coach of the offending team.",
        "ruleReference": {
          "rule": 2,
          "section": 7,
          "article": 11
        }
      },
      {
        "text": "The officials shall notify the head coach when a team is granted its final allowable time-out.",
        "ruleReference": {
          "rule": 2,
          "section": 7,
          "article": 12
        }
      },
      {
        "text": "The officials shall penalize unsporting conduct by any player, coach, substitute, team attendant or follower.",
        "ruleReference": {
          "rule": 2,
          "section": 8,
          "article": 1
        }
      },
      {
        "text": "The home management or game committee is responsible for spectator behavior, insofar as it can reasonably be expected to control the spectators.",
        "ruleReference": {
          "rule": 2,
          "section": 8,
          "article": 1
        }
      },
      {
        "text": "The officials may rule fouls on either team if its supporters act in such a way as to interfere with the proper conduct of the game.",
        "ruleReference": {
          "rule": 2,
          "section": 8,
          "article": 1
        }
      },
      {
        "text": "Discretion shall be used in ruling such fouls, however, lest a team be unjustly penalized.",
        "ruleReference": {
          "rule": 2,
          "section": 8,
          "article": 1
        }
      },
      {
        "text": "When team supporters become unruly or interfere with the orderly progress of the game, the officials shall stop the game until the host management resolves the situation and the game can proceed in an orderly manner.",
        "ruleReference": {
          "rule": 2,
          "section": 8,
          "article": 1
        }
      },
      {
        "text": "In the absence of a designated school representative, the home coach shall serve as the host management.",
        "ruleReference": {
          "rule": 2,
          "section": 8,
          "article": 1
        }
      },
      {
        "text": "The officials shall penalize and disqualify the offender if flagrant misconduct occurs.",
        "ruleReference": {
          "rule": 2,
          "section": 8,
          "article": 2
        }
      },
      {
        "text": "The officials shall remove a player from the game who commits a fifth foul (personal and technical).",
        "ruleReference": {
          "rule": 2,
          "section": 8,
          "article": 3
        }
      },
      {
        "text": "The officials shall notify the head coach and request the timer to begin the replacement interval, and then notify the player on a disqualification.",
        "ruleReference": {
          "rule": 2,
          "section": 8,
          "article": 4
        }
      },
      {
        "text": "The officials shall immediately remove a player from the game who exhibits signs, symptoms or behaviors consistent with a concussion.",
        "ruleReference": {
          "rule": 2,
          "section": 8,
          "article": 5
        }
      },
      {
        "text": "When a foul occurs, an official shall signal the timer to stop the clock.",
        "ruleReference": {
          "rule": 2,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "The official shall verbally inform the offender.",
        "ruleReference": {
          "rule": 2,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "The official shall indicate to the scorer the number of the offender and the number of free throws using finger(s) of two hands.",
        "ruleReference": {
          "rule": 2,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "When a team is entitled to a throw-in, an official shall signal the timer to stop the clock.",
        "ruleReference": {
          "rule": 2,
          "section": 9,
          "article": 2
        }
      },
      {
        "text": "The official shall clearly signal the act which caused the ball to become dead.",
        "ruleReference": {
          "rule": 2,
          "section": 9,
          "article": 2
        }
      },
      {
        "text": "The official shall clearly signal the direction of play and announce the color of the team entitled to the throw-in.",
        "ruleReference": {
          "rule": 2,
          "section": 9,
          "article": 2
        }
      },
      {
        "text": "The official shall signal the throw-in spot unless it follows a successful goal or an awarded goal.",
        "ruleReference": {
          "rule": 2,
          "section": 9,
          "article": 2
        }
      },
      {
        "text": "Officials may correct an error if a rule is inadvertently set aside and results in failure to award a merited free throw.",
        "ruleReference": {
          "rule": 2,
          "section": 10,
          "article": 1
        }
      },
      {
        "text": "Officials may correct an error if a rule is inadvertently set aside and results in awarding an unmerited free throw.",
        "ruleReference": {
          "rule": 2,
          "section": 10,
          "article": 1
        }
      },
      {
        "text": "Officials may correct an error if a rule is inadvertently set aside and results in permitting a wrong player to attempt a free throw.",
        "ruleReference": {
          "rule": 2,
          "section": 10,
          "article": 1
        }
      },
      {
        "text": "Officials may correct an error if a rule is inadvertently set aside and results in attempting a free throw at the wrong basket.",
        "ruleReference": {
          "rule": 2,
          "section": 10,
          "article": 1
        }
      },
      {
        "text": "Officials may correct an error if a rule is inadvertently set aside and results in erroneously counting or canceling a score.",
        "ruleReference": {
          "rule": 2,
          "section": 10,
          "article": 1
        }
      },
      {
        "text": "In order to correct any of the officials' errors listed in Article 1, such error shall be recognized by an official no later than during the first dead ball after the clock has properly started.",
        "ruleReference": {
          "rule": 2,
          "section": 10,
          "article": 2
        }
      },
      {
        "text": "If the error is made while the clock is running and the ball is dead, it shall be recognized by an official before the second live ball.",
        "ruleReference": {
          "rule": 2,
          "section": 10,
          "article": 3
        }
      },
      {
        "text": "If the error is a free throw by the wrong player or at the wrong basket, or the awarding of an unmerited free throw, the free throw and the activity during it, other than unsporting, flagrant, intentional or technical fouls, shall be canceled.",
        "ruleReference": {
          "rule": 2,
          "section": 10,
          "article": 4
        }
      },
      {
        "text": "Points scored, consumed time and additional activity, which may occur prior to the recognition of an error, shall not be nullified.",
        "ruleReference": {
          "rule": 2,
          "section": 10,
          "article": 5
        }
      },
      {
        "text": "Errors because of free-throw attempts by the wrong player or at the wrong basket shall be corrected by applying Rules 8-1 and 8-2.",
        "ruleReference": {
          "rule": 2,
          "section": 10,
          "article": 5
        }
      },
      {
        "text": "If an error is corrected, play shall be resumed from the point of interruption to rectify the error, unless it involves awarding a merited free throw(s) and there has been no change of team possession since the error was made, in which case play shall resume as after any free-throw attempt(s).",
        "ruleReference": {
          "rule": 2,
          "section": 10,
          "article": 6
        }
      },
      {
        "text": "The scorer shall keep a record of the names and numbers of players who are to start the game and of all substitutes who enter the game.",
        "ruleReference": {
          "rule": 2,
          "section": 11,
          "article": 1
        }
      },
      {
        "text": "It is recommended the team members' numbers be entered into the scorebook in numerical order.",
        "ruleReference": {
          "rule": 2,
          "section": 11,
          "article": 1
        }
      },
      {
        "text": "The scorer shall notify the nearer official when there is an infraction of the rules pertaining to submission of the roster, substitutions or numbers of players.",
        "ruleReference": {
          "rule": 2,
          "section": 11,
          "article": 2
        }
      },
      {
        "text": "The scorer shall signal the officials by using the game horn or a sounding device unlike that used by the referee and umpire(s).",
        "ruleReference": {
          "rule": 2,
          "section": 11,
          "article": 3
        }
      },
      {
        "text": "The scorer may use the game horn or a sounding device immediately if, or as soon as, the ball is dead or is in control of the offending team.",
        "ruleReference": {
          "rule": 2,
          "section": 11,
          "article": 3
        }
      },
      {
        "text": "The scorer shall record the field goals made, the free throws made and missed, and keep a running summary of the points scored.",
        "ruleReference": {
          "rule": 2,
          "section": 11,
          "article": 4
        }
      },
      {
        "text": "The scorer shall record warnings for head coach/bench personnel misconduct as well as the personal and technical fouls reported on each player.",
        "ruleReference": {
          "rule": 2,
          "section": 11,
          "article": 5
        }
      },
      {
        "text": "The scorer shall notify an official immediately when the fifth foul (personal and technical) is charged to any player, the second technical foul is charged to any team member, bench personnel, or directly to the head coach, or the third technical foul is charged to the head coach.",
        "ruleReference": {
          "rule": 2,
          "section": 11,
          "article": 5
        }
      },
      {
        "text": "The procedure if a player who has committed a fifth foul continues to play because the scorer has failed to notify the official is as follows: As soon as the scorer discovers the irregularity, the game horn should be sounded after, or as soon as, the ball is in control of the offending team or is dead.",
        "ruleReference": {
          "rule": 2,
          "section": 11,
          "article": 5
        }
      },
      {
        "text": "The disqualified player shall be removed immediately.",
        "ruleReference": {
          "rule": 2,
          "section": 11,
          "article": 5
        }
      },
      {
        "text": "Any points which may have been scored while such player was illegally in the game are counted.",
        "ruleReference": {
          "rule": 2,
          "section": 11,
          "article": 5
        }
      },
      {
        "text": "If other aspects of the error are correctable, the procedure to be followed is included among the duties of the officials.",
        "ruleReference": {
          "rule": 2,
          "section": 11,
          "article": 5
        }
      },
      {
        "text": "The scorer shall record the time-out information charged to each team (who and when) and notify a team and its coach, through an official, whenever that team is granted its final allotted charged time-out.",
        "ruleReference": {
          "rule": 2,
          "section": 11,
          "article": 6
        }
      },
      {
        "text": "The scorer shall record the held balls for the alternating-possession procedure and be responsible for the possession arrow.",
        "ruleReference": {
          "rule": 2,
          "section": 11,
          "article": 7
        }
      },
      {
        "text": "The scorer shall record the number of warnings in the official scorebook, as in Rules 4-47 and 4-48.",
        "ruleReference": {
          "rule": 2,
          "section": 11,
          "article": 8
        }
      },
      {
        "text": "The scorer shall signal the nearer official each time a team is granted a time-out in excess of the allotted number.",
        "ruleReference": {
          "rule": 2,
          "section": 11,
          "article": 9
        }
      },
      {
        "text": "The scorer shall signal in each quarter when a player commits a common foul beginning with the team's fifth foul.",
        "ruleReference": {
          "rule": 2,
          "section": 11,
          "article": 10
        }
      },
      {
        "text": "The scorer shall compare records with the visiting scorer after each goal, each foul, each charged time-out, and end of each quarter and extra period, notifying the referee at once of any discrepancy.",
        "ruleReference": {
          "rule": 2,
          "section": 11,
          "article": 11
        }
      },
      {
        "text": "If the mistake cannot be found, the referee shall accept the record of the official scorebook, unless the referee has knowledge to decide otherwise.",
        "ruleReference": {
          "rule": 2,
          "section": 11,
          "article": 11
        }
      },
      {
        "text": "If the discrepancy is in the score and the mistake is not resolved, the referee shall accept the progressive team totals of the official scorebook.",
        "ruleReference": {
          "rule": 2,
          "section": 11,
          "article": 11
        }
      },
      {
        "text": "A bookkeeping mistake may be corrected at any time until the referee approves the final score.",
        "ruleReference": {
          "rule": 2,
          "section": 11,
          "article": 11
        }
      },
      {
        "text": "The scorebook of the home team shall be the official book, unless the referee determines otherwise.",
        "ruleReference": {
          "rule": 2,
          "section": 11,
          "article": 11
        }
      },
      {
        "text": "The official scorebook shall remain at the scorer's table throughout the game, including all intermissions.",
        "ruleReference": {
          "rule": 2,
          "section": 11,
          "article": 11
        }
      },
      {
        "text": "The official scorer is required to wear a black-and-white vertically striped garment.",
        "ruleReference": {
          "rule": 2,
          "section": 11,
          "article": 12
        }
      },
      {
        "text": "The timer shall note when each half is to start and shall notify the referee more than three minutes before this time so the referee may notify the teams, or cause them to be notified, at least three minutes before the half is to start.",
        "ruleReference": {
          "rule": 2,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "The timer shall signal the scorer three minutes before starting time.",
        "ruleReference": {
          "rule": 2,
          "section": 12,
          "article": 2
        }
      },
      {
        "text": "The timer shall be provided with a clock to be used for timing quarters, extra periods and intermissions, and a stopwatch for timing time-outs.",
        "ruleReference": {
          "rule": 2,
          "section": 12,
          "article": 3
        }
      },
      {
        "text": "The clock shall be operated by the official timer.",
        "ruleReference": {
          "rule": 2,
          "section": 12,
          "article": 3
        }
      },
      {
        "text": "The clock and a stopwatch shall be placed so that they may be seen by the timer.",
        "ruleReference": {
          "rule": 2,
          "section": 12,
          "article": 3
        }
      },
      {
        "text": "The clock shall be started or stopped as prescribed in Rules 5-8 and 5-9.",
        "ruleReference": {
          "rule": 2,
          "section": 12,
          "article": 3
        }
      },
      {
        "text": "The timer shall sound a warning signal 15 seconds before the expiration of an intermission or a time-out, immediately after which the players shall prepare to resume play, and signal again at the end of the intermission or time-out.",
        "ruleReference": {
          "rule": 2,
          "section": 12,
          "article": 4
        }
      },
      {
        "text": "The timer shall sound a warning signal to announce 15 seconds (maximum) permitted for replacing a disqualified or injured player, or for a player directed to leave the game and signal again at the end of the interval.",
        "ruleReference": {
          "rule": 2,
          "section": 12,
          "article": 5
        }
      },
      {
        "text": "The official shall signal the timer to begin the 15-second interval for replacing an injured player after the injured player has been removed from the court and the coach has been notified that a replacement is required, except as in Rule 3-3-6.",
        "ruleReference": {
          "rule": 2,
          "section": 12,
          "article": 5
        }
      },
      {
        "text": "The timer shall stop the clock at the expiration of time for each quarter or extra period, and when an official signals time-out, as in Rule 5-8.",
        "ruleReference": {
          "rule": 2,
          "section": 12,
          "article": 6
        }
      },
      {
        "text": "For an intermission or a charged time-out, the timer shall start the stopwatch and signal the referee as outlined in Article 4.",
        "ruleReference": {
          "rule": 2,
          "section": 12,
          "article": 6
        }
      },
      {
        "text": "The timer shall indicate by signal the expiration of playing time in each quarter or extra period.",
        "ruleReference": {
          "rule": 2,
          "section": 12,
          "article": 7
        }
      },
      {
        "text": "If a red/LED light is used, the light is the official expiration of playing time.",
        "ruleReference": {
          "rule": 2,
          "section": 12,
          "article": 7
        }
      },
      {
        "text": "If the red/LED light fails to illuminate and the timer's signal fails to sound, or is not recognized by the officials, the timer shall go onto the court or use other means to immediately notify the nearest official.",
        "ruleReference": {
          "rule": 2,
          "section": 13,
          "article": 1
        }
      },
      {
        "text": "If table officials agree that time expired before the ball was in flight, the goal shall not count.",
        "ruleReference": {
          "rule": 2,
          "section": 13,
          "article": 1
        }
      },
      {
        "text": "If table officials agree that the quarter or extra period ended before the foul occurred, the foul shall be disregarded, unless it was intentional or flagrant.",
        "ruleReference": {
          "rule": 2,
          "section": 13,
          "article": 2
        }
      },
      {
        "text": "If table officials disagree, the goal shall count and/or the foul shall be penalized, unless the referee has knowledge which alters such ruling.",
        "ruleReference": {
          "rule": 2,
          "section": 13,
          "article": 3
        }
      },
      {
        "text": "By state association adoption, member state associations may establish a shot clock in which the team in control shall attempt a try for field goal within 35 seconds after gaining team control.",
        "ruleReference": {
          "rule": 2,
          "section": 14,
          "article": 1
        }
      },
      {
        "text": "The shot clock shall be regulated by a visible shot clock.",
        "ruleReference": {
          "rule": 2,
          "section": 14,
          "article": 2
        }
      },
      {
        "text": "The tap or try for field goal shall leave the shooter's hand before the expiration of time and subsequently strike the basket ring or enter the basket before or after the shot clock period has expired.",
        "ruleReference": {
          "rule": 2,
          "section": 14,
          "article": 2
        }
      }
    ]
  },
  {
    "ruleNumber": 3,
    "sentences": [
      {
        "text": "Each team consists of five players.",
        "ruleReference": {
          "rule": 3,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "One of the five players is the captain.",
        "ruleReference": {
          "rule": 3,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "A team shall begin the game with five players.",
        "ruleReference": {
          "rule": 3,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "If a team has no substitutes to replace disqualified or injured players, the team shall continue with fewer than five players.",
        "ruleReference": {
          "rule": 3,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "When there is only one player participating for a team, the team shall forfeit the game.",
        "ruleReference": {
          "rule": 3,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "The referee may believe that a team has an opportunity to win the game, in which case the team shall not forfeit the game.",
        "ruleReference": {
          "rule": 3,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "The captain is the representative of the team.",
        "ruleReference": {
          "rule": 3,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "The captain may address an official on matters of interpretation or to obtain essential information.",
        "ruleReference": {
          "rule": 3,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "The captain must address the official in a courteous manner.",
        "ruleReference": {
          "rule": 3,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "Any player may address an official to request a time-out.",
        "ruleReference": {
          "rule": 3,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "Any player may address an official to request permission to leave the court.",
        "ruleReference": {
          "rule": 3,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "At least 10 minutes before the scheduled starting time, each team shall supply the official scorer with the name and number of each team member.",
        "ruleReference": {
          "rule": 3,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "Each team shall designate the five starting players.",
        "ruleReference": {
          "rule": 3,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "Failure to comply with the requirement to supply the official scorer results in a technical foul.",
        "ruleReference": {
          "rule": 3,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "After the 10-minute time limit specified in Article 1, a team is charged with a maximum of one technical foul regardless of how many infractions are committed.",
        "ruleReference": {
          "rule": 3,
          "section": 2,
          "article": 2
        }
      },
      {
        "text": "Changing a designated starter is an infraction unless necessitated by illness, injury, illegal equipment or apparel, or to attempt a technical foul free throw.",
        "ruleReference": {
          "rule": 3,
          "section": 2,
          "article": 2
        }
      },
      {
        "text": "Adding a name to the team member list is an infraction.",
        "ruleReference": {
          "rule": 3,
          "section": 2,
          "article": 2
        }
      },
      {
        "text": "Requiring the scorer to change a team member's or player's number in the scorebook is an infraction.",
        "ruleReference": {
          "rule": 3,
          "section": 2,
          "article": 2
        }
      },
      {
        "text": "Requiring a player to change to the number in the scorebook is an infraction.",
        "ruleReference": {
          "rule": 3,
          "section": 2,
          "article": 2
        }
      },
      {
        "text": "Having identical numbers on team members and/or players is an infraction.",
        "ruleReference": {
          "rule": 3,
          "section": 2,
          "article": 2
        }
      },
      {
        "text": "A substitute who desires to enter shall report to the scorer, giving the substitute's number.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "Between quarters, at halftime and during a time-out, the substitute shall report or be in position to report to the scorer prior to the warning signal.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "The warning signal is sounded 15 seconds before the end of the intermission or the time-out.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "When the substitute(s) is not properly reported, the player(s) in the game at the conclusion of the quarter when the time-out was granted shall begin play for the new quarter after the time-out.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "Substitutions between halves may be made by the substitute or a team representative.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "During multiple free throws resulting from personal fouls, substitutions may be made only before the final attempt in the sequence and after the final attempt has been scored.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "When a player is required by rule to be replaced prior to administering the free throw(s), all other substitutes who have legally reported may also enter the game.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "If entry is at any time other than between quarters, and a substitute who is entitled and ready to enter reports to the scorer, the scorer shall use a sounding device or game horn when the ball is dead and the clock is stopped.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "A captain may request a defensive match-up if three or more substitutes from the same team enter during an opportunity to substitute.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "The substitute shall remain outside the boundary until an official beckons.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 2
        }
      },
      {
        "text": "The substitute shall enter immediately when an official beckons.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 2
        }
      },
      {
        "text": "If the ball is about to become live, the beckoning signal should be withheld.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 2
        }
      },
      {
        "text": "The entering substitute shall not replace a designated jumper or a free thrower except as in Rules 8-2 and 8-3.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 2
        }
      },
      {
        "text": "If the substitute enters to replace a player who shall jump or attempt a free throw, the substitute shall withdraw until the next opportunity to substitute.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 2
        }
      },
      {
        "text": "A substitute becomes a player when the substitute legally enters the court.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 3
        }
      },
      {
        "text": "If entry is not legal, the substitute becomes a player when the ball becomes live.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 3
        }
      },
      {
        "text": "A player becomes bench personnel after the player's substitute becomes a player or after notification of the coach following the player's disqualification.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 3
        }
      },
      {
        "text": "A player who has been replaced or directed to leave the game shall not re-enter before the next opportunity to substitute after the clock has been started properly following the player's replacement.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 4
        }
      },
      {
        "text": "A player not wearing the pants/skirt properly and above the hips shall be directed to leave the game.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 5
        }
      },
      {
        "text": "A player not tucking in a team jersey designed to be worn inside the pants/skirt shall be directed to leave the game.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 5
        }
      },
      {
        "text": "A charged time-out shall not alter the requirement for a player to leave the game if the player is not wearing the pants/skirt properly or tucking in the team jersey.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 5
        }
      },
      {
        "text": "A player who has been injured to the extent that the coach or any other bench personnel is beckoned and comes onto the court shall be directed to leave the game.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 6
        }
      },
      {
        "text": "A time-out may be requested by, and granted to, the injured player's team to correct the situation before the player is directed to leave the game.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 6
        }
      },
      {
        "text": "A player who is bleeding, has an open wound, has any amount of blood on the uniform, or has blood on the player's body shall be directed to leave the game until the situation is corrected.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 7
        }
      },
      {
        "text": "A time-out may be requested by, and granted to, the player's team to correct the situation before the player is directed to leave the game.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 7
        }
      },
      {
        "text": "If players from both teams are directed to leave the game because of injury or blood, both teams shall request and be granted a time-out to keep each player in the game.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 7
        }
      },
      {
        "text": "A time-out granted to keep a player in the game shall be requested before the replacement interval begins.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 7
        }
      },
      {
        "text": "Any player who exhibits signs, symptoms or behaviors consistent with a concussion shall be immediately removed from the game.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 8
        }
      },
      {
        "text": "A player shall not return to play until cleared by an appropriate health care professional.",
        "ruleReference": {
          "rule": 3,
          "section": 3,
          "article": 8
        }
      },
      {
        "text": "Team jersey color and design shall adhere to specific guidelines.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "The torso of the team jersey shall be the same single solid color for all team members.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "The torso is defined as the portion of the jersey from an imaginary line at the base of the neckline extending to each armhole, down to the bottom hem of the jersey and from side seam/insert to side seam/insert.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "The imaginary line at the base of the neckline shall not extend beyond 1½ inches from the lowest point of the neckline apex/opening.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "The torso color shall be white for the home team and a contrasting dark color for the visiting team.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "It is recommended that the dark torso color for the visiting team be the darker color of the school's color scheme or black.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "The gray color used in an away jersey must meet the 70-percent standard.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "There are no color/design restrictions in the area of the team jersey from the imaginary line at the base of the neckline to the top of the shoulder and in the corresponding area on the back of the jersey.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "There are restrictions on what identifying names may be placed in the area of the team jersey from the imaginary line at the base of the neckline to the top of the shoulder and in the corresponding area on the back of the jersey.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "Side inserts, including trim/piping/accent color(s), shall be no more than 4 inches in width of any color(s) or design, centered vertically below the armpit.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "Side inserts for all team jerseys shall be the same width.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "Trim, piping or an accent color differing from the torso color shall not exceed 1 inch around the arm openings, except as specified in item d.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "A visible manufacturer's logo/trademark/reference is permitted on the team jersey, not to exceed 2¼ square inches with no dimension more than 2¼ inches.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 2
        }
      },
      {
        "text": "The manufacturer's logo may be located no more than 5 inches below the shoulder seam on the front of the jersey, or 2 inches from the neckline on the back of the jersey, or in either side insert.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 2
        }
      },
      {
        "text": "The American flag may be worn anywhere on the team jersey provided it does not exceed 2 x 3 inches and does not interfere with the visibility of the player's number.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 2
        }
      },
      {
        "text": "By state association adoption, one commemorative/memorial patch may be worn on the jersey.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 2
        }
      },
      {
        "text": "The commemorative/memorial patch shall not exceed 4 square inches, shall not be a number and shall be located above the neckline or in the side insert.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 2
        }
      },
      {
        "text": "A school or conference logo/mascot may be located at the apex/opening of the neckline or above it, in the corresponding area on the back of the jersey and/or in either side insert.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 2
        }
      },
      {
        "text": "Team jerseys shall include the team member's number, which shall be at least 6 inches high on the back and at least 4 inches high on the front and not less than ¾ inch in width excluding the border.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 3
        }
      },
      {
        "text": "The number(s) shall be centered vertically and horizontally on the portion of the jersey that is intended to be visible.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 3
        }
      },
      {
        "text": "The number(s) on the front and back of the team jersey shall be the same color and style.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 3
        }
      },
      {
        "text": "Each team member shall be numbered on the front and back of the team jersey with plain Arabic numerals.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 3
        }
      },
      {
        "text": "The following numbers are legal: 0, 1, 2, 3, 4, 5, 00, 10, 11, 12, 13, 14, 15, 20, 21, 22, 23, 24, 25, 30, 31, 32, 33, 34, 35, 40, 41, 42, 43, 44, 45, 50, 51, 52, 53, 54, 55.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 3
        }
      },
      {
        "text": "A team member list shall not have both numbers 0 and 00.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 3
        }
      },
      {
        "text": "No more than three colors may be used on the number.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 3
        }
      },
      {
        "text": "The style of the number shall be clearly visible and conform to specific guidelines.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 3
        }
      },
      {
        "text": "If the team jersey color is used as a border, it shall be counted as one of the allowed colors.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 3
        }
      },
      {
        "text": "A solid contrasting color with no more than two solid color ¼-inch borders around the entire number is permitted.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 3
        }
      },
      {
        "text": "The team jersey color itself when bordered with not more than two ¼-inch solid border(s) contrasting with the team jersey color is permitted, but this option shall be eliminated by 2024-25.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 3
        }
      },
      {
        "text": "A solid contrasting color with a 'shadow' trim of a contrasting color on part of the number not to exceed ½ inch in width and may be used with one ¼-inch border is permitted.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 3
        }
      },
      {
        "text": "If used, lettering with school name, school's nickname, school logo name, player's name and/or abbreviations of the official school name shall be placed horizontally on the jersey.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 4
        }
      },
      {
        "text": "The panel in the shoulder area of the jersey on the back may be used for placing identifying names as well.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 4
        }
      },
      {
        "text": "Lettering above a number may be arched, but the first and last letters shall be on the same horizontal plane, which shall not be below a plane extending through the top of the number(s).",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 4
        }
      },
      {
        "text": "Lettering below a number shall have the first and last letters on the same horizontal plane and said plane shall not be above a plane extending through the bottom of the numbers(s).",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 4
        }
      },
      {
        "text": "Any point on any letter shall not be closer than one inch to any point on any number(s).",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 4
        }
      },
      {
        "text": "Any form of decorative accent in an identifying name or abbreviation is only permitted if the name or abbreviation is located above the number.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 4
        }
      },
      {
        "text": "If a tail is used in the lettering of an identifying name or abbreviation, the name or abbreviation shall be located below the number.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 4
        }
      },
      {
        "text": "Multiple styles of uniform bottoms may be worn by teammates and may include shorts, skirts or pants.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 5
        }
      },
      {
        "text": "Uniform bottoms shall have only one visible manufacturer's logo/trademark/reference.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 5
        }
      },
      {
        "text": "Showing multiple manufacturer's logos on the waist band of the bottoms makes the item illegal.",
        "ruleReference": {
          "rule": 3,
          "section": 4,
          "article": 5
        }
      },
      {
        "text": "The referee shall not permit any team member to wear equipment or apparel which, in the referee's judgment, is dangerous or confusing to other players or is not appropriate.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "Each state association may authorize exceptions to NFHS playing rules to provide reasonable accommodations to individual participants with disabilities and/or special needs.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "The accommodations should not fundamentally alter the sport, heighten risk to the athlete or others, or place opponents at a disadvantage.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "A guard, cast or brace made of a hard and unyielding substance shall not be worn on the elbow, hand, finger/thumb, wrist or forearm, even though covered with soft padding.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 2
        }
      },
      {
        "text": "Hard and unyielding items on the upper arm or shoulder shall be padded with a closed-cell, slow-recovery foam padding no less than ½ inch thick.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 2
        }
      },
      {
        "text": "Knee and ankle braces which are unaltered from the manufacturer's original design/production are permitted and do not require any additional padding/covering nor do the braces need to meet the color restrictions.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 2
        }
      },
      {
        "text": "A protective face mask may be worn and made of hard material, but shall be worn molded to the face with no protrusions.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 2
        }
      },
      {
        "text": "Arm sleeves, knee sleeves, lower leg sleeves, compression shorts and tights are permissible.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 3
        }
      },
      {
        "text": "Anything worn on the arm and/or leg is a sleeve, except a knee brace, and shall meet the color restrictions.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 3
        }
      },
      {
        "text": "The sleeves/tights, compression shorts shall be black, white, beige or the predominant color of the jersey and the same color sleeves/tights shall be worn by teammates.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 3
        }
      },
      {
        "text": "All sleeves/tights, compression shorts shall be the same solid color and shall be the same color as any headband or wristband worn.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 3
        }
      },
      {
        "text": "Headbands and wristbands shall be white, black, beige or the predominant color of the jersey and shall be the same color for each item and all participants.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 4
        }
      },
      {
        "text": "A headband is any item that goes around the entire head.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 4
        }
      },
      {
        "text": "If worn, only one headband is permitted, it shall be worn on the forehead/crown, it shall be nonabrasive and unadorned, and it shall be no more than 3 inches wide.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 4
        }
      },
      {
        "text": "If worn, only one wristband is permitted on each wrist, each shall be worn on the arm below the elbow, each shall be moisture-absorbing, nonabrasive and unadorned, and each shall be a maximum of 4 inches wide.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 4
        }
      },
      {
        "text": "Rubber, cloth or elastic bands may be used to control hair.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 4
        }
      },
      {
        "text": "Hard items, including beads, barrettes, bobby pins and other adornments in the hair that are securely fastened to the head and do not present an increased risk to the player, teammates or opponents are allowed.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 4
        }
      },
      {
        "text": "Head coverings worn for religious reasons shall not be made of abrasive or hard materials and must be attached in such a way that the coverings are highly unlikely to come off during play.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 4
        }
      },
      {
        "text": "The state association shall be notified, after the contest, if there is a concern about a head covering worn for religious reasons.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 4
        }
      },
      {
        "text": "Equipment which is unnatural and/or designed to increase a team member's height or vertical reach or to gain a competitive advantage shall not be permitted.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 5
        }
      },
      {
        "text": "Equipment and apparel shall not be modified from the original manufactured state and shall be worn in the manner the manufacturer intended it to be worn.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 5
        }
      },
      {
        "text": "Undershirts, if worn, must adhere to specific guidelines.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 6
        }
      },
      {
        "text": "Undershirts shall be a single solid color similar to the torso of the jersey or be solid black and shall be hemmed and not have frayed or ragged edges.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 6
        }
      },
      {
        "text": "If the undershirt has sleeves, they shall be the same length.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 6
        }
      },
      {
        "text": "Only one visible logo is permitted on undershirts.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 6
        }
      },
      {
        "text": "Jewelry is prohibited.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 7
        }
      },
      {
        "text": "Religious and medical-alert medals are not considered jewelry.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 7
        }
      },
      {
        "text": "A religious medal shall be taped and worn under the uniform.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 7
        }
      },
      {
        "text": "A medical-alert medal shall be taped and may be visible.",
        "ruleReference": {
          "rule": 3,
          "section": 5,
          "article": 7
        }
      },
      {
        "text": "One visible manufacturer's logo/trademark/reference or school logo/mascot is permitted on the wristbands, headband, compression shorts, undershirts, and arm and leg compression sleeves.",
        "ruleReference": {
          "rule": 3,
          "section": 6,
          "article": 1
        }
      },
      {
        "text": "The size of the logo shall be limited to 2¼ square inches and shall not exceed 2¼ inches in any dimension on any item.",
        "ruleReference": {
          "rule": 3,
          "section": 6,
          "article": 2
        }
      },
      {
        "text": "The referee shall not permit any team member to participate if in the referee's judgment any item constitutes a safety concern.",
        "ruleReference": {
          "rule": 3,
          "section": 7,
          "article": 1
        }
      },
      {
        "text": "A tooth and mouth protector, if worn, shall include an occlusal portion.",
        "ruleReference": {
          "rule": 3,
          "section": 8,
          "article": 1
        }
      },
      {
        "text": "A tooth and mouth protector, if worn, shall include a labial portion.",
        "ruleReference": {
          "rule": 3,
          "section": 8,
          "article": 1
        }
      },
      {
        "text": "A tooth and mouth protector, if worn, shall cover the posterior teeth with adequate thickness.",
        "ruleReference": {
          "rule": 3,
          "section": 8,
          "article": 1
        }
      },
      {
        "text": "It is recommended that the protector be properly fitted, protecting the anterior dental arch.",
        "ruleReference": {
          "rule": 3,
          "section": 8,
          "article": 2
        }
      },
      {
        "text": "The protector may be constructed from a model made from an impression of the individual's teeth.",
        "ruleReference": {
          "rule": 3,
          "section": 8,
          "article": 2
        }
      },
      {
        "text": "The protector may be constructed and fitted to the individual by impressing the teeth into the tooth and mouth protector itself.",
        "ruleReference": {
          "rule": 3,
          "section": 8,
          "article": 2
        }
      },
      {
        "text": "State associations may deem a tooth and mouth protector required equipment.",
        "ruleReference": {
          "rule": 3,
          "section": 8,
          "article": 3
        }
      }
    ]
  },
  {
    "ruleNumber": 4,
    "sentences": [
      {
        "text": "An airborne shooter is a player who has released the ball on a try or tap for a goal.",
        "ruleReference": {
          "rule": 4,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "An airborne shooter is a player who has tapped the ball and has not returned to the floor.",
        "ruleReference": {
          "rule": 4,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "The airborne shooter is considered to be in the act of shooting.",
        "ruleReference": {
          "rule": 4,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "Alternating possession is the method of putting the ball in play by a throw-in as outlined in Rule 6-4.",
        "ruleReference": {
          "rule": 4,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "The possession arrow is a device located at the scorer's table.",
        "ruleReference": {
          "rule": 4,
          "section": 2,
          "article": 2
        }
      },
      {
        "text": "The possession arrow is used to indicate the direction of a team's basket for the alternating-possession procedure.",
        "ruleReference": {
          "rule": 4,
          "section": 2,
          "article": 2
        }
      },
      {
        "text": "Alternating-possession control is established when a player secures control of the ball after the jump ball beginning the game and each extra period.",
        "ruleReference": {
          "rule": 4,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "The initial direction of the possession arrow is set toward the opponent's basket when a player secures control of the ball after the jump ball beginning the game and each extra period.",
        "ruleReference": {
          "rule": 4,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "The ball is placed at the disposal of the free thrower after a common foul when the bonus free throws are in effect.",
        "ruleReference": {
          "rule": 4,
          "section": 3,
          "article": 2
        }
      },
      {
        "text": "The ball is placed at the disposal of the thrower after a violation during or following the jump ball before a player secures control.",
        "ruleReference": {
          "rule": 4,
          "section": 3,
          "article": 3
        }
      },
      {
        "text": "The ball is placed at the disposal of the thrower after the free throws for a noncommon foul.",
        "ruleReference": {
          "rule": 4,
          "section": 3,
          "article": 3
        }
      },
      {
        "text": "The ball is placed at the disposal of the thrower after a common foul before the bonus free throws are in effect.",
        "ruleReference": {
          "rule": 4,
          "section": 3,
          "article": 3
        }
      },
      {
        "text": "This procedure is used only to establish the alternating-possession procedure.",
        "ruleReference": {
          "rule": 4,
          "section": 3,
          "article": 3
        }
      },
      {
        "text": "A ball which is in contact with a player or with the court is in the backcourt if either the ball or the player is touching the backcourt.",
        "ruleReference": {
          "rule": 4,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "A ball which is in contact with a player or with the court is in the frontcourt if neither the ball nor the player is touching the backcourt.",
        "ruleReference": {
          "rule": 4,
          "section": 4,
          "article": 2
        }
      },
      {
        "text": "A ball which is in flight retains the same location/status as when it was last in contact with a player or the court.",
        "ruleReference": {
          "rule": 4,
          "section": 4,
          "article": 3
        }
      },
      {
        "text": "A ball which touches a player or an official is the same as the ball touching the floor at that individual's location/status.",
        "ruleReference": {
          "rule": 4,
          "section": 4,
          "article": 4
        }
      },
      {
        "text": "A ball which touches the front faces or edges of the backboard is treated the same as touching the floor inbounds.",
        "ruleReference": {
          "rule": 4,
          "section": 4,
          "article": 5
        }
      },
      {
        "text": "During a dribble from backcourt to frontcourt, the ball is in the frontcourt when the ball and both feet of the dribbler touch the court entirely in the frontcourt.",
        "ruleReference": {
          "rule": 4,
          "section": 4,
          "article": 6
        }
      },
      {
        "text": "A ball is at the disposal of a player when it is handed to a thrower or free thrower.",
        "ruleReference": {
          "rule": 4,
          "section": 4,
          "article": 7
        }
      },
      {
        "text": "A ball is at the disposal of a player when it is caught by a thrower or free thrower after it is bounced to the player.",
        "ruleReference": {
          "rule": 4,
          "section": 4,
          "article": 7
        }
      },
      {
        "text": "A ball is at the disposal of a player when it is placed on the floor at the spot.",
        "ruleReference": {
          "rule": 4,
          "section": 4,
          "article": 7
        }
      },
      {
        "text": "A ball is at the disposal of a player when it is available to a player after a goal and the official begins the throw-in count.",
        "ruleReference": {
          "rule": 4,
          "section": 4,
          "article": 7
        }
      },
      {
        "text": "A team's own basket is the one into which its players try to throw or tap the ball.",
        "ruleReference": {
          "rule": 4,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "Each team's basket for practice before the game and for the first half shall be the one farther from its team bench.",
        "ruleReference": {
          "rule": 4,
          "section": 5,
          "article": 2
        }
      },
      {
        "text": "The teams shall change baskets for the second half.",
        "ruleReference": {
          "rule": 4,
          "section": 5,
          "article": 3
        }
      },
      {
        "text": "If by mistake the officials permit a team to go the wrong direction, all points scored, fouls committed, and time consumed shall count as if each team had gone the proper direction.",
        "ruleReference": {
          "rule": 4,
          "section": 5,
          "article": 4
        }
      },
      {
        "text": "Play shall resume with each team going the proper direction based on bench location.",
        "ruleReference": {
          "rule": 4,
          "section": 5,
          "article": 4
        }
      },
      {
        "text": "Basket interference occurs when a player touches the ball or any part of the basket while the ball is on or within either basket.",
        "ruleReference": {
          "rule": 4,
          "section": 6,
          "article": 1
        }
      },
      {
        "text": "Basket interference occurs when a player touches the ball while any part of the ball is within the imaginary cylinder which has the basket ring as its lower base.",
        "ruleReference": {
          "rule": 4,
          "section": 6,
          "article": 2
        }
      },
      {
        "text": "If a player has a hand legally in contact with the ball, it is not a violation if such contact with the ball continues after it enters the imaginary cylinder or if in such action, the player touches the basket.",
        "ruleReference": {
          "rule": 4,
          "section": 6,
          "article": 2
        }
      },
      {
        "text": "Dunking or stuffing is legal and is not basket interference.",
        "ruleReference": {
          "rule": 4,
          "section": 6,
          "article": 2
        }
      },
      {
        "text": "Basket interference occurs when a player touches the ball outside the cylinder while reaching through the basket from below.",
        "ruleReference": {
          "rule": 4,
          "section": 6,
          "article": 3
        }
      },
      {
        "text": "Basket interference occurs when a player pulls down a movable ring so that it contacts the ball before the ring returns to its original position.",
        "ruleReference": {
          "rule": 4,
          "section": 6,
          "article": 4
        }
      },
      {
        "text": "Blocking is illegal personal contact which impedes the progress of an opponent with or without the ball.",
        "ruleReference": {
          "rule": 4,
          "section": 7,
          "article": 1
        }
      },
      {
        "text": "Charging is illegal personal contact caused by pushing or moving into an opponent's torso.",
        "ruleReference": {
          "rule": 4,
          "section": 7,
          "article": 2
        }
      },
      {
        "text": "A player who is moving with the ball is required to stop or change direction to avoid contact if a defensive player has obtained a legal guarding position in the player's path.",
        "ruleReference": {
          "rule": 4,
          "section": 7,
          "article": 2
        }
      },
      {
        "text": "If a guard has obtained a legal guarding position, the player with the ball shall get head and shoulders past the torso of the defensive player.",
        "ruleReference": {
          "rule": 4,
          "section": 7,
          "article": 2
        }
      },
      {
        "text": "If contact occurs on the torso of the defensive player, the dribbler is responsible for the contact.",
        "ruleReference": {
          "rule": 4,
          "section": 7,
          "article": 2
        }
      },
      {
        "text": "There shall be reasonable space between two defensive players or a defensive player and a boundary line to allow the dribbler to continue in the dribbler's path.",
        "ruleReference": {
          "rule": 4,
          "section": 7,
          "article": 2
        }
      },
      {
        "text": "If there is less than 3 feet of space, the dribbler has the greater responsibility for the contact.",
        "ruleReference": {
          "rule": 4,
          "section": 7,
          "article": 2
        }
      },
      {
        "text": "The player with the ball may not push the torso of the guard to gain an advantage to pass, shoot or dribble.",
        "ruleReference": {
          "rule": 4,
          "section": 7,
          "article": 2
        }
      },
      {
        "text": "The bonus is the two free throws awarded for a common foul as follows:",
        "ruleReference": {
          "rule": 4,
          "section": 8,
          "article": 1
        }
      },
      {
        "text": "Beginning with a team's fifth foul in each quarter, two free throws are awarded, regardless of whether or not the first free throw is successful.",
        "ruleReference": {
          "rule": 4,
          "section": 8,
          "article": 1
        }
      },
      {
        "text": "Team fouls will be reset to zero at the end of each quarter.",
        "ruleReference": {
          "rule": 4,
          "section": 8,
          "article": 1
        }
      },
      {
        "text": "Player-control, team-control and technical fouls are counted as team fouls to reach the bonus.",
        "ruleReference": {
          "rule": 4,
          "section": 8,
          "article": 2
        }
      },
      {
        "text": "When a technical foul is also charged indirectly to the head coach, it counts only as one team foul.",
        "ruleReference": {
          "rule": 4,
          "section": 8,
          "article": 2
        }
      },
      {
        "text": "Boundary lines of the court consist of end lines and sidelines.",
        "ruleReference": {
          "rule": 4,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "The inside edges of these lines define the inbounds and out-of-bounds areas.",
        "ruleReference": {
          "rule": 4,
          "section": 9,
          "article": 2
        }
      },
      {
        "text": "A closely guarded situation occurs when a player in control of the ball in the player's team's frontcourt is continuously guarded by any opponent who is within six feet of the player who is holding or dribbling the ball.",
        "ruleReference": {
          "rule": 4,
          "section": 10,
          "article": 1
        }
      },
      {
        "text": "The distance shall be measured from the forward foot/feet of the defender to the forward foot/feet of the ball handler.",
        "ruleReference": {
          "rule": 4,
          "section": 10,
          "article": 1
        }
      },
      {
        "text": "A closely guarded count shall be terminated when the offensive player in control of the ball gets head and shoulders past the defensive player.",
        "ruleReference": {
          "rule": 4,
          "section": 10,
          "article": 1
        }
      },
      {
        "text": "Continuous motion applies to a try or tap for field goals and free throws.",
        "ruleReference": {
          "rule": 4,
          "section": 11,
          "article": 1
        }
      },
      {
        "text": "Continuous motion has no significance unless there is a foul by any defensive player during the interval which begins when the habitual throwing movement starts a try or with the touching on a tap and ends when the ball is clearly in flight.",
        "ruleReference": {
          "rule": 4,
          "section": 11,
          "article": 1
        }
      },
      {
        "text": "If an opponent fouls after a player has started a try or tap for field goal, the player is permitted to complete the customary arm movement.",
        "ruleReference": {
          "rule": 4,
          "section": 11,
          "article": 2
        }
      },
      {
        "text": "If pivoting or stepping when fouled, the player may complete the usual foot or body movement in any activity while holding the ball.",
        "ruleReference": {
          "rule": 4,
          "section": 11,
          "article": 2
        }
      },
      {
        "text": "These privileges are granted only when the usual throwing motion has started before the foul occurs and before the ball is in flight.",
        "ruleReference": {
          "rule": 4,
          "section": 11,
          "article": 2
        }
      },
      {
        "text": "Continuous motion does not apply if a teammate fouls after a player has started a try or tap for field goal and before the ball is in flight.",
        "ruleReference": {
          "rule": 4,
          "section": 11,
          "article": 3
        }
      },
      {
        "text": "The ball becomes dead immediately in such a case.",
        "ruleReference": {
          "rule": 4,
          "section": 11,
          "article": 3
        }
      },
      {
        "text": "A player is in control of the ball when the player is holding or dribbling a live ball.",
        "ruleReference": {
          "rule": 4,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "There is no player control when, during a jump ball, a jumper catches the ball prior to the ball touching the floor or a non-jumper, or during an interrupted dribble.",
        "ruleReference": {
          "rule": 4,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "A team is in control of the ball when a player of the team is in control.",
        "ruleReference": {
          "rule": 4,
          "section": 12,
          "article": 2
        }
      },
      {
        "text": "A team is in control of the ball while a live ball is being passed among teammates.",
        "ruleReference": {
          "rule": 4,
          "section": 12,
          "article": 2
        }
      },
      {
        "text": "A team is in control of the ball during an interrupted dribble.",
        "ruleReference": {
          "rule": 4,
          "section": 12,
          "article": 2
        }
      },
      {
        "text": "A team is in control of the ball when a player of the team has disposal of the ball for a throw-in.",
        "ruleReference": {
          "rule": 4,
          "section": 12,
          "article": 2
        }
      },
      {
        "text": "Team control continues until the ball is in flight during a try or tap for field goal.",
        "ruleReference": {
          "rule": 4,
          "section": 12,
          "article": 3
        }
      },
      {
        "text": "Team control continues until an opponent secures control.",
        "ruleReference": {
          "rule": 4,
          "section": 12,
          "article": 3
        }
      },
      {
        "text": "Team control continues until the ball becomes dead.",
        "ruleReference": {
          "rule": 4,
          "section": 12,
          "article": 3
        }
      },
      {
        "text": "While the ball remains live, a loose ball always remains in control of the team whose player last had control, unless it is a try or tap for goal.",
        "ruleReference": {
          "rule": 4,
          "section": 12,
          "article": 4
        }
      },
      {
        "text": "Team control does not exist during a jump ball or the touching of a rebound, but is re-established when a player secures control.",
        "ruleReference": {
          "rule": 4,
          "section": 12,
          "article": 5
        }
      },
      {
        "text": "Neither team control nor player control exists during a dead ball, a jump ball or when the ball is in flight during a try or tap for a field goal.",
        "ruleReference": {
          "rule": 4,
          "section": 12,
          "article": 6
        }
      },
      {
        "text": "A team's frontcourt consists of that part of the court between its end line and the nearer edge of the division line, including its basket and the inbounds part of the backboard.",
        "ruleReference": {
          "rule": 4,
          "section": 13,
          "article": 1
        }
      },
      {
        "text": "A team's backcourt consists of the rest of the court, including the entire division line and the opponent's basket and inbounds part of the opponent's backboard.",
        "ruleReference": {
          "rule": 4,
          "section": 13,
          "article": 2
        }
      },
      {
        "text": "A disqualified player is one who is barred from further participation in the game because of having committed a fifth foul (personal and technical), two technical fouls or a flagrant foul.",
        "ruleReference": {
          "rule": 4,
          "section": 14,
          "article": 1
        }
      },
      {
        "text": "A player is officially disqualified and becomes bench personnel when the coach is notified by an official.",
        "ruleReference": {
          "rule": 4,
          "section": 14,
          "article": 2
        }
      },
      {
        "text": "A dribble is ball movement caused by a player in control who bats or pushes the ball to the floor once or several times.",
        "ruleReference": {
          "rule": 4,
          "section": 15,
          "article": 1
        }
      },
      {
        "text": "It is not a part of a dribble when the ball touches a player's own backboard.",
        "ruleReference": {
          "rule": 4,
          "section": 15,
          "article": 1
        }
      },
      {
        "text": "During a dribble, the ball may be batted into the air provided it is permitted to strike the floor before the ball is touched again with the hand(s).",
        "ruleReference": {
          "rule": 4,
          "section": 15,
          "article": 2
        }
      },
      {
        "text": "The dribble begins by pushing, throwing or batting the ball to the floor before the pivot foot is lifted.",
        "ruleReference": {
          "rule": 4,
          "section": 15,
          "article": 3
        }
      },
      {
        "text": "The dribble ends when the dribbler catches or causes the ball to come to rest in one or both hands.",
        "ruleReference": {
          "rule": 4,
          "section": 15,
          "article": 4
        }
      },
      {
        "text": "The dribble ends when the dribbler palms/carries the ball by allowing it to come to rest in one or both hands.",
        "ruleReference": {
          "rule": 4,
          "section": 15,
          "article": 4
        }
      },
      {
        "text": "The dribble ends when the dribbler simultaneously touches the ball with both hands.",
        "ruleReference": {
          "rule": 4,
          "section": 15,
          "article": 4
        }
      },
      {
        "text": "The dribble ends when the ball touches or is touched by an opponent and causes the dribbler to lose control.",
        "ruleReference": {
          "rule": 4,
          "section": 15,
          "article": 4
        }
      },
      {
        "text": "The dribble ends when the ball becomes dead.",
        "ruleReference": {
          "rule": 4,
          "section": 15,
          "article": 4
        }
      },
      {
        "text": "An interrupted dribble occurs when the ball is loose after deflecting off the dribbler or after it momentarily gets away from the dribbler.",
        "ruleReference": {
          "rule": 4,
          "section": 15,
          "article": 5
        }
      },
      {
        "text": "There is no player control during an interrupted dribble.",
        "ruleReference": {
          "rule": 4,
          "section": 15,
          "article": 5
        }
      },
      {
        "text": "During an interrupted dribble, a closely guarded count shall not be started or shall be terminated.",
        "ruleReference": {
          "rule": 4,
          "section": 15,
          "article": 6
        }
      },
      {
        "text": "During an interrupted dribble, a player-control foul cannot be committed, but a team-control foul still may be committed.",
        "ruleReference": {
          "rule": 4,
          "section": 15,
          "article": 6
        }
      },
      {
        "text": "During an interrupted dribble, a time-out request shall not be granted.",
        "ruleReference": {
          "rule": 4,
          "section": 15,
          "article": 6
        }
      },
      {
        "text": "During an interrupted dribble, out-of-bounds violation does not apply on the player involved in the interrupted dribble.",
        "ruleReference": {
          "rule": 4,
          "section": 15,
          "article": 6
        }
      },
      {
        "text": "Dunking is the driving, forcing, pushing or attempting to force a ball through the basket with the hand(s).",
        "ruleReference": {
          "rule": 4,
          "section": 16,
          "article": 1
        }
      },
      {
        "text": "An extra period is the extension of playing time necessary to break a tie score.",
        "ruleReference": {
          "rule": 4,
          "section": 17,
          "article": 1
        }
      },
      {
        "text": "Fighting is a flagrant act and can occur when the ball is dead or live.",
        "ruleReference": {
          "rule": 4,
          "section": 18,
          "article": 1
        }
      },
      {
        "text": "Fighting includes, but is not limited to combative acts such as an attempt to strike, punch or kick by using a fist, hands, arms, legs or feet regardless of whether contact is made.",
        "ruleReference": {
          "rule": 4,
          "section": 18,
          "article": 1
        }
      },
      {
        "text": "Fighting includes, but is not limited to an attempt to instigate a fight by committing an unsporting act that causes a person to retaliate by fighting.",
        "ruleReference": {
          "rule": 4,
          "section": 18,
          "article": 2
        }
      },
      {
        "text": "A foul is an infraction of the rules which is charged and is penalized.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 1
        }
      },
      {
        "text": "A personal foul is a player foul which involves illegal contact with an opponent while the ball is live, which hinders an opponent from performing normal defensive and offensive movements.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 1
        }
      },
      {
        "text": "A personal foul also includes contact by or on an airborne shooter when the ball is dead.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 1
        }
      },
      {
        "text": "Contact after the ball has become dead is incidental unless it is ruled intentional or flagrant or is committed by or on an airborne shooter.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 1
        }
      },
      {
        "text": "A common foul is a personal foul which is neither flagrant nor intentional nor committed against a player trying or tapping for a field goal nor a part of a double, simultaneous or multiple foul.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 2
        }
      },
      {
        "text": "An intentional foul is a personal or technical foul that may or may not be premeditated and is not based solely on the severity of the act.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 3
        }
      },
      {
        "text": "Intentional fouls include, but are not limited to contact that neutralizes an opponent's obvious advantageous position.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 3
        }
      },
      {
        "text": "Intentional fouls include, but are not limited to contact away from the ball with an opponent who is clearly not involved with a play.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 3
        }
      },
      {
        "text": "Intentional fouls include, but are not limited to contact that is not a legitimate attempt to play the ball/player specifically designed to stop the clock or keep it from starting.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 3
        }
      },
      {
        "text": "Intentional fouls include, but are not limited to excessive contact with an opponent while the ball is live or until an airborne shooter returns to the floor.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 3
        }
      },
      {
        "text": "Intentional fouls include, but are not limited to contact with a thrower-in as in Rule 9-2-10 PENALTY 4.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 3
        }
      },
      {
        "text": "A flagrant foul may be a personal or technical foul of a violent or excessive nature, or a technical noncontact foul which displays unacceptable conduct.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 4
        }
      },
      {
        "text": "A flagrant foul may or may not be intentional.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 4
        }
      },
      {
        "text": "If personal, a flagrant foul involves, but is not limited to violent contact such as striking, kicking and kneeing.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 4
        }
      },
      {
        "text": "If technical, a flagrant foul involves dead-ball contact or noncontact conduct at any time which is extreme or persistent, vulgar or abusive conduct.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 4
        }
      },
      {
        "text": "A technical foul is a foul by a nonplayer.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 5
        }
      },
      {
        "text": "A technical foul is a noncontact foul by a player.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 5
        }
      },
      {
        "text": "A technical foul is an intentional or flagrant contact foul while the ball is dead, except a foul by an airborne shooter.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 5
        }
      },
      {
        "text": "A technical foul is a direct technical, charged to the head coach because of the head coach's actions, as in Rule 10-6.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 5
        }
      },
      {
        "text": "A technical foul is an indirect technical, charged to the head coach as a result of a bench technical foul being assessed to team bench personnel, as in 10-5.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 5
        }
      },
      {
        "text": "A player-control foul is a common foul committed by a player while in control of the ball or by an airborne shooter.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 6
        }
      },
      {
        "text": "A team-control foul is a common foul committed by a member of the team that has team control or by a member of the throw-in team from the start of the throw-in until player control is obtained inbounds.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 7
        }
      },
      {
        "text": "A double personal foul is a situation in which two opponents commit personal fouls against each other at approximately the same time.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 8
        }
      },
      {
        "text": "A double technical foul is a situation in which two opponents commit technical fouls against each other at approximately the same time.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 8
        }
      },
      {
        "text": "A false double foul is a situation in which there are fouls by both teams, the second of which occurs before the clock is started following the first, and such that at least one of the attributes of a double foul is absent.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 9
        }
      },
      {
        "text": "A simultaneous foul (personal or technical) by opponents is a situation in which there is a foul by both teams which occurs at approximately the same time, but are not committed by opponents against each other.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 10
        }
      },
      {
        "text": "A multiple foul is a situation in which two or more teammates commit personal fouls against the same opponent at approximately the same time.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 11
        }
      },
      {
        "text": "A false multiple foul is a situation in which there are two or more fouls by the same team and the last foul is committed before the clock is started following the first, and at least one of the attributes of a multiple foul is absent.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 12
        }
      },
      {
        "text": "A team foul is any personal foul or technical foul (except indirect technical fouls) which is charged to either team.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 13
        }
      },
      {
        "text": "All team fouls are counted to reach the bonus free throws for the quarter in which they are assessed.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 13
        }
      },
      {
        "text": "An unsporting foul is a noncontact technical foul which consists of unfair, unethical, dishonorable conduct or any behavior not in accordance with the spirit of fair play.",
        "ruleReference": {
          "rule": 4,
          "section": 19,
          "article": 14
        }
      },
      {
        "text": "A free throw is the opportunity given a player to score one point by an unhindered try for goal from within the free-throw semicircle and behind the free-throw line.",
        "ruleReference": {
          "rule": 4,
          "section": 20,
          "article": 1
        }
      },
      {
        "text": "The free throw begins when the ball is at the disposal of the free thrower.",
        "ruleReference": {
          "rule": 4,
          "section": 20,
          "article": 2
        }
      },
      {
        "text": "The free throw ends when the try is successful, when it is certain the try will not be successful, when the try touches the floor or any player, or when the ball becomes dead.",
        "ruleReference": {
          "rule": 4,
          "section": 20,
          "article": 3
        }
      },
      {
        "text": "A fumble is the accidental loss of player control when the ball unintentionally drops or slips from a player's grasp.",
        "ruleReference": {
          "rule": 4,
          "section": 21,
          "article": 1
        }
      },
      {
        "text": "Goaltending occurs when a player touches the ball during a try or tap for field goal while the ball is in its downward flight entirely above the basket ring level, has the possibility of entering the basket in flight and is not touching the basket cylinder.",
        "ruleReference": {
          "rule": 4,
          "section": 22,
          "article": 1
        }
      },
      {
        "text": "Goaltending occurs when a player touches the ball outside the cylinder during a free-throw attempt.",
        "ruleReference": {
          "rule": 4,
          "section": 22,
          "article": 2
        }
      },
      {
        "text": "Guarding is the act of legally placing the body in the path of an offensive opponent.",
        "ruleReference": {
          "rule": 4,
          "section": 23,
          "article": 1
        }
      },
      {
        "text": "There is no minimum distance required between the guard and opponent, but the maximum is 6 feet when closely guarded.",
        "ruleReference": {
          "rule": 4,
          "section": 23,
          "article": 1
        }
      },
      {
        "text": "Every player is entitled to a spot on the playing court provided such player gets there first without illegally contacting an opponent.",
        "ruleReference": {
          "rule": 4,
          "section": 23,
          "article": 1
        }
      },
      {
        "text": "A player who extends an arm, shoulder, hip or leg into the path of an opponent is not considered to have a legal position if contact occurs.",
        "ruleReference": {
          "rule": 4,
          "section": 23,
          "article": 1
        }
      },
      {
        "text": "To obtain an initial legal guarding position, the guard shall have both feet touching the playing court.",
        "ruleReference": {
          "rule": 4,
          "section": 23,
          "article": 2
        }
      },
      {
        "text": "To obtain an initial legal guarding position, the front of the guard's torso shall be facing the opponent.",
        "ruleReference": {
          "rule": 4,
          "section": 23,
          "article": 2
        }
      },
      {
        "text": "After the initial legal guarding position is obtained, the guard may have one or both feet on the playing court or be airborne, provided the guard has inbound status.",
        "ruleReference": {
          "rule": 4,
          "section": 23,
          "article": 3
        }
      },
      {
        "text": "After the initial legal guarding position is obtained, the guard is not required to continue facing the opponent.",
        "ruleReference": {
          "rule": 4,
          "section": 23,
          "article": 3
        }
      },
      {
        "text": "After the initial legal guarding position is obtained, the guard may move laterally or obliquely to maintain position, provided it is not toward the opponent when contact occurs.",
        "ruleReference": {
          "rule": 4,
          "section": 23,
          "article": 3
        }
      },
      {
        "text": "After the initial legal guarding position is obtained, the guard may raise hands or jump within the guard's own vertical plane.",
        "ruleReference": {
          "rule": 4,
          "section": 23,
          "article": 3
        }
      },
      {
        "text": "After the initial legal guarding position is obtained, the guard may turn or duck to absorb the shock of imminent contact.",
        "ruleReference": {
          "rule": 4,
          "section": 23,
          "article": 3
        }
      },
      {
        "text": "Guarding an opponent with the ball or a stationary opponent without the ball requires no time or distance to obtain an initial legal position.",
        "ruleReference": {
          "rule": 4,
          "section": 23,
          "article": 4
        }
      },
      {
        "text": "If the opponent with the ball is airborne, the guard shall have obtained legal position before the opponent left the floor.",
        "ruleReference": {
          "rule": 4,
          "section": 23,
          "article": 4
        }
      },
      {
        "text": "Guarding a moving opponent without the ball requires time and distance to obtain an initial legal position.",
        "ruleReference": {
          "rule": 4,
          "section": 23,
          "article": 5
        }
      },
      {
        "text": "The guard shall give the opponent the time and/or distance to avoid contact.",
        "ruleReference": {
          "rule": 4,
          "section": 23,
          "article": 5
        }
      },
      {
        "text": "The distance need not be more than two strides.",
        "ruleReference": {
          "rule": 4,
          "section": 23,
          "article": 5
        }
      },
      {
        "text": "If the opponent is airborne, the guard shall have obtained legal position before the opponent left the floor.",
        "ruleReference": {
          "rule": 4,
          "section": 23,
          "article": 5
        }
      }
    ]
  },
  {
    "ruleNumber": 5,
    "sentences": [
      {
        "text": "A goal is made when a live ball enters the basket from above and remains in or passes through.",
        "ruleReference": {
          "rule": 5,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "No goal is scored if an untouched throw-in goes through the basket.",
        "ruleReference": {
          "rule": 5,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "Whether the clock is running or stopped has no influence on the counting of a goal.",
        "ruleReference": {
          "rule": 5,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "If a player-control foul occurs before or after a goal, the goal is canceled.",
        "ruleReference": {
          "rule": 5,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "A successful try, tap or thrown ball from the field by a player who is located behind the team's own 19-foot, 9-inch arc counts three points.",
        "ruleReference": {
          "rule": 5,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "A ball that touches the floor counts two points for the team into whose basket the ball is thrown.",
        "ruleReference": {
          "rule": 5,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "A ball that touches a teammate inside the arc counts two points for the team into whose basket the ball is thrown.",
        "ruleReference": {
          "rule": 5,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "A ball that touches an official counts two points for the team into whose basket the ball is thrown.",
        "ruleReference": {
          "rule": 5,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "A ball that touches any other goal from the field counts two points for the team into whose basket the ball is thrown.",
        "ruleReference": {
          "rule": 5,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "A goal from a free throw counts one point for the free-thrower's team.",
        "ruleReference": {
          "rule": 5,
          "section": 2,
          "article": 2
        }
      },
      {
        "text": "A goal from a free throw is credited to the free thrower.",
        "ruleReference": {
          "rule": 5,
          "section": 2,
          "article": 2
        }
      },
      {
        "text": "If a player scores a field goal in the opponent's basket, it is not credited to a player.",
        "ruleReference": {
          "rule": 5,
          "section": 2,
          "article": 3
        }
      },
      {
        "text": "If a player scores a field goal in the opponent's basket, it is indicated in a footnote.",
        "ruleReference": {
          "rule": 5,
          "section": 2,
          "article": 3
        }
      },
      {
        "text": "The only infractions for which points are awarded are goaltending by the defense or basket interference at the opponent's basket.",
        "ruleReference": {
          "rule": 5,
          "section": 2,
          "article": 4
        }
      },
      {
        "text": "When play is resumed with a throw-in or free throw and three-tenths (.3) of a second or less remains on the clock, a player may not gain control of the ball and try for a field goal.",
        "ruleReference": {
          "rule": 5,
          "section": 2,
          "article": 5
        }
      },
      {
        "text": "In the situation where three-tenths (.3) of a second or less remains on the clock, only a tap could score.",
        "ruleReference": {
          "rule": 5,
          "section": 2,
          "article": 5
        }
      },
      {
        "text": "This rule does not apply if the clock does not display tenths of a second.",
        "ruleReference": {
          "rule": 5,
          "section": 2,
          "article": 5
        }
      },
      {
        "text": "The winning team is the one which has accumulated the greater number of points when the game ends.",
        "ruleReference": {
          "rule": 5,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "A game shall be declared a forfeit when a team refuses to play after being instructed to do so by an official.",
        "ruleReference": {
          "rule": 5,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "A game shall be declared a forfeit when a coach is removed from the premises for unsporting conduct and no authorized school personnel is present to assume responsibility for the team.",
        "ruleReference": {
          "rule": 5,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "A game shall be declared a forfeit when any player, team member, bench personnel or coach fails to comply with any technical foul penalty, or repeatedly commits technical-foul infractions or other acts which make a travesty of the game.",
        "ruleReference": {
          "rule": 5,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "If the team to which the game is forfeited is ahead, the score at the time of forfeiture must stand.",
        "ruleReference": {
          "rule": 5,
          "section": 4,
          "article": 2
        }
      },
      {
        "text": "If the team to which the game is forfeited is not ahead, the score must be recorded as 2-0 in its favor.",
        "ruleReference": {
          "rule": 5,
          "section": 4,
          "article": 2
        }
      },
      {
        "text": "The NFHS Basketball Rules Committee does not recognize protests.",
        "ruleReference": {
          "rule": 5,
          "section": 4,
          "article": 3
        }
      },
      {
        "text": "Whenever a game is interrupted because of events beyond the control of the responsible administrative authorities, it shall be continued from the point of interruption unless the teams agree to terminate the game with the existing score, or there are conference, league or state association rules to cover the situation.",
        "ruleReference": {
          "rule": 5,
          "section": 4,
          "article": 4
        }
      },
      {
        "text": "Playing time for teams of high school age shall be four quarters of eight minutes each with intermissions of one minute after the first and third quarters, and 10 minutes between halves.",
        "ruleReference": {
          "rule": 5,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "The halftime intermission may be extended to a maximum of 15 minutes for special activities, provided home management has properly notified the visiting team prior to the start of the game.",
        "ruleReference": {
          "rule": 5,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "An organization sponsoring games involving teams which combine ninth-grade students with students in the eighth and/or seventh grades may play those games in quarters of eight minutes.",
        "ruleReference": {
          "rule": 5,
          "section": 5,
          "article": 2
        }
      },
      {
        "text": "A quarter(s) may be shortened in an emergency or at any time by mutual agreement of the opposing coaches and the referee.",
        "ruleReference": {
          "rule": 5,
          "section": 5,
          "article": 3
        }
      },
      {
        "text": "By state association adoption, a running clock may be instituted when a specified point differential is reached at a specified time in the game.",
        "ruleReference": {
          "rule": 5,
          "section": 5,
          "article": 3
        }
      },
      {
        "text": "Each quarter or extra period begins when the ball first becomes live.",
        "ruleReference": {
          "rule": 5,
          "section": 6,
          "article": 1
        }
      },
      {
        "text": "Each quarter or extra period ends when the signal illuminates or sounds indicating time has expired.",
        "ruleReference": {
          "rule": 5,
          "section": 6,
          "article": 2
        }
      },
      {
        "text": "If the ball is in flight during a try or tap for field goal, the quarter or extra period ends when the try or tap ends.",
        "ruleReference": {
          "rule": 5,
          "section": 6,
          "article": 2
        }
      },
      {
        "text": "If a held ball or violation occurs so near the expiration of time that the clock is not stopped before time expires, the quarter or extra period ends with the held ball or violation.",
        "ruleReference": {
          "rule": 5,
          "section": 6,
          "article": 2
        }
      },
      {
        "text": "If a foul occurs so near the expiration of time that the timer cannot get the clock stopped before time expires or after time expires, but while the ball is in flight during a try or tap for field goal, the quarter or extra period ends when the free throw(s) and all related activity have been completed.",
        "ruleReference": {
          "rule": 5,
          "section": 6,
          "article": 2
        }
      },
      {
        "text": "No penalty or part of a penalty carries over from one quarter or extra period to the next, except when a correctable error is rectified.",
        "ruleReference": {
          "rule": 5,
          "section": 6,
          "article": 2
        }
      },
      {
        "text": "No free throw(s) shall be attempted after time has expired for the fourth quarter or any extra period, unless the point(s) would affect the outcome of the game.",
        "ruleReference": {
          "rule": 5,
          "section": 6,
          "article": 2
        }
      },
      {
        "text": "If a technical foul occurs after the ball becomes dead to end a quarter or extra period, the next quarter or extra period is started by administering the free throws.",
        "ruleReference": {
          "rule": 5,
          "section": 6,
          "article": 2
        }
      },
      {
        "text": "If the fourth quarter or extra period ends and the score is tied, the free throws will start the extra period.",
        "ruleReference": {
          "rule": 5,
          "section": 6,
          "article": 2
        }
      },
      {
        "text": "If the score is not tied and the results of the free throws would tie or win the game, the free throws are administered as part of the preceding quarter/period.",
        "ruleReference": {
          "rule": 5,
          "section": 6,
          "article": 2
        }
      },
      {
        "text": "If the score is tied at the end of the fourth quarter, play shall continue without change of baskets for one or more extra periods with a one-minute intermission before each extra period.",
        "ruleReference": {
          "rule": 5,
          "section": 7,
          "article": 1
        }
      },
      {
        "text": "The game ends if, at the end of any extra period, the score is not tied.",
        "ruleReference": {
          "rule": 5,
          "section": 7,
          "article": 2
        }
      },
      {
        "text": "The length of each extra period shall be four minutes (or half the time of a regulation quarter for non-varsity contests).",
        "ruleReference": {
          "rule": 5,
          "section": 7,
          "article": 3
        }
      },
      {
        "text": "As many extra periods as are necessary to break the tie shall be played.",
        "ruleReference": {
          "rule": 5,
          "section": 7,
          "article": 3
        }
      },
      {
        "text": "Extra periods are an extension of the fourth quarter.",
        "ruleReference": {
          "rule": 5,
          "section": 7,
          "article": 3
        }
      },
      {
        "text": "Once the ball becomes live in the extra period, it will be played even though a correction in the fourth quarter score is made.",
        "ruleReference": {
          "rule": 5,
          "section": 7,
          "article": 4
        }
      },
      {
        "text": "Time-out occurs and the clock, if running, shall be stopped when an official signals a foul.",
        "ruleReference": {
          "rule": 5,
          "section": 8,
          "article": 1
        }
      },
      {
        "text": "Time-out occurs and the clock, if running, shall be stopped when an official signals a held ball.",
        "ruleReference": {
          "rule": 5,
          "section": 8,
          "article": 1
        }
      },
      {
        "text": "Time-out occurs and the clock, if running, shall be stopped when an official signals a violation.",
        "ruleReference": {
          "rule": 5,
          "section": 8,
          "article": 1
        }
      },
      {
        "text": "Time-out occurs and the clock, if running, shall be stopped when an official signals a time-out.",
        "ruleReference": {
          "rule": 5,
          "section": 8,
          "article": 1
        }
      },
      {
        "text": "The clock is stopped because of an injury as in Rules 3-3-6, 3-3-7 and 3-3-8.",
        "ruleReference": {
          "rule": 5,
          "section": 8,
          "article": 2
        }
      },
      {
        "text": "The clock is stopped to confer with the scorer or timer.",
        "ruleReference": {
          "rule": 5,
          "section": 8,
          "article": 2
        }
      },
      {
        "text": "The clock is stopped because of unusual delay in getting a dead ball live.",
        "ruleReference": {
          "rule": 5,
          "section": 8,
          "article": 2
        }
      },
      {
        "text": "The clock is stopped for any other situations or any emergency.",
        "ruleReference": {
          "rule": 5,
          "section": 8,
          "article": 2
        }
      },
      {
        "text": "When a player is injured as in Article 2(a), the official may suspend play after the ball is dead or is in control of the injured player's team or when the opponents complete a play.",
        "ruleReference": {
          "rule": 5,
          "section": 8,
          "article": 2
        }
      },
      {
        "text": "A play is completed when a team loses control or withholds the ball from play by ceasing to attempt to score or advance the ball to a scoring position.",
        "ruleReference": {
          "rule": 5,
          "section": 8,
          "article": 2
        }
      },
      {
        "text": "When necessary to protect an injured player, the official may immediately stop play.",
        "ruleReference": {
          "rule": 5,
          "section": 8,
          "article": 2
        }
      },
      {
        "text": "A time-out is granted and signaled for a player's/head coach's oral or visual request for a time-out, such request being granted only when the ball is at the disposal or in control of a player of the same team.",
        "ruleReference": {
          "rule": 5,
          "section": 8,
          "article": 3
        }
      },
      {
        "text": "A time-out is granted and signaled for a player's/head coach's oral or visual request for a time-out, such request being granted only when the ball is dead, unless replacement of a disqualified, or injured player(s), or a player directed to leave the game is pending, and a substitute(s) is available and required.",
        "ruleReference": {
          "rule": 5,
          "section": 8,
          "article": 3
        }
      },
      {
        "text": "The clock shall be started when the official signals the clock to start after time has been out.",
        "ruleReference": {
          "rule": 5,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "If the official neglects to signal, the timer is authorized to start the clock as per rule, unless an official specifically signals continued time-out.",
        "ruleReference": {
          "rule": 5,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "If play is started or resumed by a jump ball, the clock shall be started when the tossed ball is legally touched.",
        "ruleReference": {
          "rule": 5,
          "section": 9,
          "article": 2
        }
      },
      {
        "text": "If a free throw is not successful and the ball is to remain live, the clock shall be started when the ball touches or is touched by a player on the court.",
        "ruleReference": {
          "rule": 5,
          "section": 9,
          "article": 3
        }
      },
      {
        "text": "If play is resumed by a throw-in, the clock shall be started when the ball touches, or is legally touched by, a player on the court after it is released by the thrower.",
        "ruleReference": {
          "rule": 5,
          "section": 9,
          "article": 4
        }
      },
      {
        "text": "The referee may correct an obvious mistake by the timer to start or stop the clock properly only when the referee has definite information relative to the time involved.",
        "ruleReference": {
          "rule": 5,
          "section": 10,
          "article": 1
        }
      },
      {
        "text": "The exact time observed by the official may be placed on the clock.",
        "ruleReference": {
          "rule": 5,
          "section": 10,
          "article": 1
        }
      },
      {
        "text": "If the referee determines the clock malfunctioned or was not started/stopped properly, or if the clock did not run, an official's count or other official information may be used to make a correction.",
        "ruleReference": {
          "rule": 5,
          "section": 10,
          "article": 2
        }
      },
      {
        "text": "Three 60-second and two 30-second time-outs may be charged to each team during a regulation game.",
        "ruleReference": {
          "rule": 5,
          "section": 11,
          "article": 1
        }
      },
      {
        "text": "Each team is entitled to one additional 60-second time-out during each extra period.",
        "ruleReference": {
          "rule": 5,
          "section": 11,
          "article": 1
        }
      },
      {
        "text": "Unused time-outs accumulate and may be used at any time.",
        "ruleReference": {
          "rule": 5,
          "section": 11,
          "article": 1
        }
      },
      {
        "text": "State associations may determine the number of electronic media time-outs for games which are transmitted and may reduce the number of charged time-outs.",
        "ruleReference": {
          "rule": 5,
          "section": 11,
          "article": 1
        }
      },
      {
        "text": "A single 60-second time-out charged to a team shall not exceed one minute and shall be conducted within the confines of the time-out area.",
        "ruleReference": {
          "rule": 5,
          "section": 11,
          "article": 2
        }
      },
      {
        "text": "A warning signal for the teams to prepare to resume play is sounded with 15 seconds remaining during a single 60-second time-out.",
        "ruleReference": {
          "rule": 5,
          "section": 11,
          "article": 2
        }
      },
      {
        "text": "A single 30-second charged time-out shall not exceed 30 seconds and players shall remain standing within the time-out area.",
        "ruleReference": {
          "rule": 5,
          "section": 11,
          "article": 3
        }
      },
      {
        "text": "A warning signal for teams to prepare to resume play is sounded with 15 seconds remaining during a single 30-second time-out.",
        "ruleReference": {
          "rule": 5,
          "section": 11,
          "article": 3
        }
      },
      {
        "text": "No on-court entertainment shall occur during a single 30-second time-out.",
        "ruleReference": {
          "rule": 5,
          "section": 11,
          "article": 3
        }
      },
      {
        "text": "Only one 60-second time-out is charged in Rule 5-8-4 regardless of the amount of time consumed when no correction is made.",
        "ruleReference": {
          "rule": 5,
          "section": 11,
          "article": 4
        }
      },
      {
        "text": "No time-out is charged if, in Rule 5-8-3, the player's request results from displaced eyeglasses or lens.",
        "ruleReference": {
          "rule": 5,
          "section": 11,
          "article": 4
        }
      },
      {
        "text": "No time-out is charged if, in Rule 5-8-4, the error or mistake is prevented or rectified.",
        "ruleReference": {
          "rule": 5,
          "section": 11,
          "article": 4
        }
      },
      {
        "text": "A time-out shall not be granted until after the ball has become live to start the game.",
        "ruleReference": {
          "rule": 5,
          "section": 11,
          "article": 5
        }
      },
      {
        "text": "The additional 60-second time-out provided for each extra period(s) shall not be granted until after the ball has become live to start the extra period(s).",
        "ruleReference": {
          "rule": 5,
          "section": 11,
          "article": 5
        }
      },
      {
        "text": "Time-outs in excess of the allotted number may be requested and shall be granted during regulation playing time or any extra period at the expense of a technical foul for each.",
        "ruleReference": {
          "rule": 5,
          "section": 11,
          "article": 6
        }
      },
      {
        "text": "Successive time-outs shall not be granted after the expiration of playing time for the fourth quarter or any extra period.",
        "ruleReference": {
          "rule": 5,
          "section": 11,
          "article": 7
        }
      },
      {
        "text": "In all other instances, successive time-outs shall be administered in the order in which they were requested.",
        "ruleReference": {
          "rule": 5,
          "section": 11,
          "article": 7
        }
      },
      {
        "text": "Time-outs simultaneously requested by opposing teams shall be granted, charged to the respective team and administered concurrently.",
        "ruleReference": {
          "rule": 5,
          "section": 11,
          "article": 8
        }
      },
      {
        "text": "When one team is charged with a 30-second time-out and the other a 60-second time-out, the duration shall be 60 seconds.",
        "ruleReference": {
          "rule": 5,
          "section": 11,
          "article": 8
        }
      }
    ]
  },
  {
    "ruleNumber": 6,
    "sentences": [
      {
        "text": "The game and each extra period shall be started by a jump ball in the center restraining circle.",
        "ruleReference": {
          "rule": 6,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "After any subsequent dead ball, the only way to get the ball live is to resume play by a jump ball in the center restraining circle.",
        "ruleReference": {
          "rule": 6,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "After any subsequent dead ball, the only way to get the ball live is to resume play by a throw-in.",
        "ruleReference": {
          "rule": 6,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "After any subsequent dead ball, the only way to get the ball live is to resume play by a free throw.",
        "ruleReference": {
          "rule": 6,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "The dribble and traveling rules are not in effect in these situations.",
        "ruleReference": {
          "rule": 6,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "The ball becomes live when the tossed ball leaves the official's hand(s) during a jump ball.",
        "ruleReference": {
          "rule": 6,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "The ball becomes live when it is at the disposal of the thrower during a throw-in.",
        "ruleReference": {
          "rule": 6,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "The ball becomes live when it is at the disposal of the free thrower during a free throw.",
        "ruleReference": {
          "rule": 6,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "Any rules statement is made on the assumption that no infraction is involved unless mentioned or implied.",
        "ruleReference": {
          "rule": 6,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "If such infraction occurs, the rule governing it is followed.",
        "ruleReference": {
          "rule": 6,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "A game or extra period will not start with a jump ball if a foul occurs before the ball becomes live.",
        "ruleReference": {
          "rule": 6,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "The game, quarter and each extra period begins when the ball becomes live as specified in Rule 6-1-2 for a jump ball, throw-in or free throw.",
        "ruleReference": {
          "rule": 6,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "To start the game and each extra period, the ball shall be put in play in the center restraining circle by a jump ball between any two opponents.",
        "ruleReference": {
          "rule": 6,
          "section": 2,
          "article": 2
        }
      },
      {
        "text": "To start the second, third and fourth quarters, the ball shall be put in play by a throw-in under the alternating-possession procedure.",
        "ruleReference": {
          "rule": 6,
          "section": 2,
          "article": 3
        }
      },
      {
        "text": "For any jump ball, each jumper shall have both feet within that half of the center restraining circle which is farther from the jumper's basket.",
        "ruleReference": {
          "rule": 6,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "When the official is ready and until the ball is tossed, nonjumpers shall not move onto the center restraining circle.",
        "ruleReference": {
          "rule": 6,
          "section": 3,
          "article": 2
        }
      },
      {
        "text": "When the official is ready and until the ball is tossed, nonjumpers shall not change position around the center restraining circle.",
        "ruleReference": {
          "rule": 6,
          "section": 3,
          "article": 2
        }
      },
      {
        "text": "Teammates may not occupy adjacent positions around the center restraining circle if an opponent indicates a desire for one of these positions before the official is ready to toss the ball.",
        "ruleReference": {
          "rule": 6,
          "section": 3,
          "article": 3
        }
      },
      {
        "text": "The ball shall be tossed upward between the jumpers in a plane at right angles to the sidelines.",
        "ruleReference": {
          "rule": 6,
          "section": 3,
          "article": 4
        }
      },
      {
        "text": "The toss shall be to a height greater than either of the jumpers can jump so that it will drop between them.",
        "ruleReference": {
          "rule": 6,
          "section": 3,
          "article": 4
        }
      },
      {
        "text": "Until the tossed ball is touched by one or both jumpers, nonjumpers shall not have either foot break the plane of the center restraining circle cylinder.",
        "ruleReference": {
          "rule": 6,
          "section": 3,
          "article": 5
        }
      },
      {
        "text": "Until the tossed ball is touched by one or both jumpers, nonjumpers shall not take a position in any occupied space.",
        "ruleReference": {
          "rule": 6,
          "section": 3,
          "article": 5
        }
      },
      {
        "text": "The tossed ball shall be touched by one or both of the jumpers after it reaches its highest point.",
        "ruleReference": {
          "rule": 6,
          "section": 3,
          "article": 6
        }
      },
      {
        "text": "If the ball contacts the floor without being touched by at least one of the jumpers, the official shall toss it again.",
        "ruleReference": {
          "rule": 6,
          "section": 3,
          "article": 6
        }
      },
      {
        "text": "Neither jumper shall touch the tossed ball before it reaches its highest point.",
        "ruleReference": {
          "rule": 6,
          "section": 3,
          "article": 7
        }
      },
      {
        "text": "Neither jumper shall leave the center restraining circle until the ball has been touched.",
        "ruleReference": {
          "rule": 6,
          "section": 3,
          "article": 7
        }
      },
      {
        "text": "Neither jumper shall catch the ball before the jump ball ends.",
        "ruleReference": {
          "rule": 6,
          "section": 3,
          "article": 7
        }
      },
      {
        "text": "Neither jumper shall touch the ball more than twice.",
        "ruleReference": {
          "rule": 6,
          "section": 3,
          "article": 7
        }
      },
      {
        "text": "The jump ball and the restrictions in Rule 6-3-7 end when the touched ball contacts one of the eight nonjumpers, an official or the floor.",
        "ruleReference": {
          "rule": 6,
          "section": 3,
          "article": 8
        }
      },
      {
        "text": "During a jump ball, a jumper is not required to face the jumper's own basket, provided the jumper is in the proper half of the center restraining circle.",
        "ruleReference": {
          "rule": 6,
          "section": 3,
          "article": 8
        }
      },
      {
        "text": "The jumper is not required to jump and attempt to touch the tossed ball.",
        "ruleReference": {
          "rule": 6,
          "section": 3,
          "article": 8
        }
      },
      {
        "text": "If neither jumper touches the ball, it should be tossed again with both jumpers being ordered to jump and try to touch the ball.",
        "ruleReference": {
          "rule": 6,
          "section": 3,
          "article": 8
        }
      },
      {
        "text": "Other than the start of the game and each extra period, the teams will alternate taking the ball out of bounds for a throw-in.",
        "ruleReference": {
          "rule": 6,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "The team obtaining control from the jump ball establishes the alternating-possession procedure.",
        "ruleReference": {
          "rule": 6,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "The arrow is set toward the opponent's basket when the alternating-possession procedure is established.",
        "ruleReference": {
          "rule": 6,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "Control may also be established by the results of a violation or foul, as in Rule 4-3.",
        "ruleReference": {
          "rule": 6,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "To start the second, third and fourth quarters, the throw-in shall be from out of bounds at the division line opposite the scorer's and timer's table.",
        "ruleReference": {
          "rule": 6,
          "section": 4,
          "article": 2
        }
      },
      {
        "text": "Alternating-possession throw-ins shall be from one of the four designated spots nearest to where the ball was located if possession is retained or gained in the team's frontcourt.",
        "ruleReference": {
          "rule": 6,
          "section": 4,
          "article": 3
        }
      },
      {
        "text": "Alternating-possession throw-ins shall be from the out-of-bounds spot nearest to where the ball was located if possession is retained or gained in the team's backcourt.",
        "ruleReference": {
          "rule": 6,
          "section": 4,
          "article": 3
        }
      },
      {
        "text": "An alternating-possession throw-in shall result when a held ball occurs.",
        "ruleReference": {
          "rule": 6,
          "section": 4,
          "article": 4
        }
      },
      {
        "text": "An alternating-possession throw-in shall result when the ball goes out of bounds, as in Rule 7-3.",
        "ruleReference": {
          "rule": 6,
          "section": 4,
          "article": 4
        }
      },
      {
        "text": "An alternating-possession throw-in shall result when simultaneous floor or free-throw violations occur.",
        "ruleReference": {
          "rule": 6,
          "section": 4,
          "article": 4
        }
      },
      {
        "text": "An alternating-possession throw-in shall result when a live ball lodges between the backboard and ring or comes to rest on the flange, unless a free throw or throw-in follows.",
        "ruleReference": {
          "rule": 6,
          "section": 4,
          "article": 4
        }
      },
      {
        "text": "An alternating-possession throw-in shall result when opponents commit simultaneous basket-interference violations.",
        "ruleReference": {
          "rule": 6,
          "section": 4,
          "article": 4
        }
      },
      {
        "text": "An alternating-possession throw-in shall result when the point of interruption cannot be determined as in Rule 4-36-2c.",
        "ruleReference": {
          "rule": 6,
          "section": 4,
          "article": 4
        }
      },
      {
        "text": "When the alternating-possession procedure has not been established, the jump ball shall be in the center restraining circle between the two players involved in the previous action.",
        "ruleReference": {
          "rule": 6,
          "section": 4,
          "article": 4
        }
      },
      {
        "text": "The direction of the possession arrow is reversed immediately after an alternating-possession throw-in ends.",
        "ruleReference": {
          "rule": 6,
          "section": 4,
          "article": 5
        }
      },
      {
        "text": "An alternating-possession throw-in ends when the throw-in ends, as in Rule 4-42-5.",
        "ruleReference": {
          "rule": 6,
          "section": 4,
          "article": 5
        }
      },
      {
        "text": "The opportunity to make an alternating-possession throw-in is lost if the throw-in team violates.",
        "ruleReference": {
          "rule": 6,
          "section": 4,
          "article": 6
        }
      },
      {
        "text": "If either team fouls during an alternating-possession throw-in, it does not cause the throw-in team to lose the possession arrow.",
        "ruleReference": {
          "rule": 6,
          "section": 4,
          "article": 6
        }
      },
      {
        "text": "If the defensive team commits a violation during the throw-in, the possession arrow is not switched.",
        "ruleReference": {
          "rule": 6,
          "section": 4,
          "article": 6
        }
      },
      {
        "text": "The ball shall be put in play by a throw-in under circumstances as outlined in Rules 6-4-1, 6-4-2, 6-4-4; Rules 7-1 through 7-6; Rule 8-5; and Rules 9-1 through 9-13.",
        "ruleReference": {
          "rule": 6,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "The ball shall be put in play by placing it at the disposal of the free thrower before each free throw.",
        "ruleReference": {
          "rule": 6,
          "section": 6,
          "article": 1
        }
      },
      {
        "text": "The ball becomes dead, or remains dead, when a goal is made, as in Rule 5-1.",
        "ruleReference": {
          "rule": 6,
          "section": 7,
          "article": 1
        }
      },
      {
        "text": "The ball becomes dead, or remains dead, when it is apparent the free throw will not be successful on a free throw which is to be followed by another free throw.",
        "ruleReference": {
          "rule": 6,
          "section": 7,
          "article": 2
        }
      },
      {
        "text": "The ball becomes dead, or remains dead, when it is apparent the free throw will not be successful on a free throw which is to be followed by a throw-in.",
        "ruleReference": {
          "rule": 6,
          "section": 7,
          "article": 2
        }
      },
      {
        "text": "The ball becomes dead, or remains dead, when a held ball occurs, or the ball lodges between the backboard and ring or comes to rest on the flange.",
        "ruleReference": {
          "rule": 6,
          "section": 7,
          "article": 3
        }
      },
      {
        "text": "The ball becomes dead, or remains dead, when a player-control or team-control foul occurs.",
        "ruleReference": {
          "rule": 6,
          "section": 7,
          "article": 4
        }
      },
      {
        "text": "The ball becomes dead, or remains dead, when an official's whistle is blown.",
        "ruleReference": {
          "rule": 6,
          "section": 7,
          "article": 5
        }
      },
      {
        "text": "The ball becomes dead, or remains dead, when time expires for a quarter or extra period.",
        "ruleReference": {
          "rule": 6,
          "section": 7,
          "article": 6
        }
      },
      {
        "text": "The ball becomes dead, or remains dead, when a foul, other than player-control or team-control, occurs.",
        "ruleReference": {
          "rule": 6,
          "section": 7,
          "article": 7
        }
      },
      {
        "text": "The ball becomes dead, or remains dead, when a free-throw violation by the throwing team occurs, as in Rule 9-1.",
        "ruleReference": {
          "rule": 6,
          "section": 7,
          "article": 8
        }
      },
      {
        "text": "The ball becomes dead, or remains dead, when a violation occurs, as in Rules 9-2 through 13.",
        "ruleReference": {
          "rule": 6,
          "section": 7,
          "article": 9
        }
      },
      {
        "text": "The ball does not become dead until the try or tap for field goal ends, or until the airborne shooter returns to the floor, when Article 5, 6, or 7 occurs while a try or tap for a field goal is in flight.",
        "ruleReference": {
          "rule": 6,
          "section": 7,
          "article": 9
        }
      },
      {
        "text": "The ball does not become dead until the try or tap for field goal ends, or until the airborne shooter returns to the floor, when Article 5 or 7 occurs while a try for a free throw is in flight.",
        "ruleReference": {
          "rule": 6,
          "section": 7,
          "article": 9
        }
      },
      {
        "text": "The ball does not become dead until the try or tap for field goal ends, or until the airborne shooter returns to the floor, when Article 7 occurs by any opponent of a player who has started a try or tap for field goal before the foul occurred, provided time did not expire before the ball was in flight.",
        "ruleReference": {
          "rule": 6,
          "section": 7,
          "article": 9
        }
      },
      {
        "text": "The trying motion shall be continuous and begins after the ball comes to rest in the player's hand(s) on a try or touches the hand(s) on a tap, and is completed when the ball is clearly in flight.",
        "ruleReference": {
          "rule": 6,
          "section": 7,
          "article": 9
        }
      },
      {
        "text": "The trying motion may include arm, foot or body movements used by the player when throwing the ball at the player's basket.",
        "ruleReference": {
          "rule": 6,
          "section": 7,
          "article": 9
        }
      },
      {
        "text": "If A1's try or tap for field goal is legally touched in flight, the goal counts if made, if the period/quarter ends before or after the legal touching.",
        "ruleReference": {
          "rule": 6,
          "section": 7,
          "article": 9
        }
      },
      {
        "text": "If the touching is interference or goaltending by Team A, no points are scored.",
        "ruleReference": {
          "rule": 6,
          "section": 7,
          "article": 9
        }
      },
      {
        "text": "If Team B violates, the points are awarded – either two or three depending on whether it was a two or three-point try or tap for field goal.",
        "ruleReference": {
          "rule": 6,
          "section": 7,
          "article": 9
        }
      }
    ]
  },
  {
    "ruleNumber": 7,
    "sentences": [
      {
        "text": "A player is out of bounds when the player touches the floor, or any object other than a player/person, on or outside a boundary.",
        "ruleReference": {
          "rule": 7,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "For location/status of a player in the air, see Rule 4-35.",
        "ruleReference": {
          "rule": 7,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "The ball is out of bounds when it touches or is touched by a player who is out of bounds.",
        "ruleReference": {
          "rule": 7,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "The ball is out of bounds when it touches or is touched by any other person, the floor, or any object on or outside a boundary.",
        "ruleReference": {
          "rule": 7,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "The ball is out of bounds when it touches or is touched by the supports or back of the backboard.",
        "ruleReference": {
          "rule": 7,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "The ball is out of bounds when it touches or is touched by the ceiling, overhead equipment or supports.",
        "ruleReference": {
          "rule": 7,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "The ball is out of bounds when it passes over a rectangular backboard.",
        "ruleReference": {
          "rule": 7,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "The ball is caused to go out of bounds by the last player in bounds to touch it or be touched by it.",
        "ruleReference": {
          "rule": 7,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "The ball is caused to go out of bounds unless the ball touches a player who is out of bounds prior to touching something out of bounds other than a player.",
        "ruleReference": {
          "rule": 7,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "If the ball is out of bounds because of touching or being touched by a player who is on or outside a boundary line, such player causes it to go out.",
        "ruleReference": {
          "rule": 7,
          "section": 2,
          "article": 2
        }
      },
      {
        "text": "If the ball goes out of bounds and was last touched simultaneously by two opponents, both of whom are inbounds or out of bounds, play shall be resumed by the team entitled to the alternating-possession throw-in at the spot out of bounds nearest to where the simultaneous violation occurred.",
        "ruleReference": {
          "rule": 7,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "If the official is in doubt as to who last touched the ball or if the officials disagree, play shall be resumed by the team entitled to the alternating-possession throw-in at the spot out of bounds nearest to where the simultaneous violation occurred.",
        "ruleReference": {
          "rule": 7,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "If the alternating-possession procedure has not been established, play shall be resumed by a jump ball between the two players involved in the center restraining circle.",
        "ruleReference": {
          "rule": 7,
          "section": 3,
          "article": 2
        }
      },
      {
        "text": "The ball is awarded out of bounds after a violation, as in Rules 9-1 through 13.",
        "ruleReference": {
          "rule": 7,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "The ball is awarded out of bounds after a free throw for a technical foul, or a flagrant or intentional personal foul, as in Rules 8-5-2 and 8-5-3.",
        "ruleReference": {
          "rule": 7,
          "section": 4,
          "article": 2
        }
      },
      {
        "text": "The ball is awarded out of bounds after a field goal or a successful free throw for any other personal foul as in Rule 8-5-1 or an awarded goal, as in Rules 9-11 and 9-12.",
        "ruleReference": {
          "rule": 7,
          "section": 4,
          "article": 3
        }
      },
      {
        "text": "The ball is awarded out of bounds when the ball becomes dead while a team is in control, provided no infraction or the end of a quarter/period is involved.",
        "ruleReference": {
          "rule": 7,
          "section": 4,
          "article": 4
        }
      },
      {
        "text": "The ball is awarded out of bounds after a player-control or team-control foul.",
        "ruleReference": {
          "rule": 7,
          "section": 4,
          "article": 5
        }
      },
      {
        "text": "The ball is awarded out of bounds after a common foul before the bonus rule is in effect.",
        "ruleReference": {
          "rule": 7,
          "section": 4,
          "article": 6
        }
      },
      {
        "text": "The ball is awarded out of bounds after a held ball, as in Rule 4-25, after the alternating-possession procedure has been established.",
        "ruleReference": {
          "rule": 7,
          "section": 4,
          "article": 7
        }
      },
      {
        "text": "When a team does not make a thrower available, after a time-out or the intermission between any quarter, the resumption-of-play procedure is used to prevent delay.",
        "ruleReference": {
          "rule": 7,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "The administering official will sound the whistle to indicate play will resume.",
        "ruleReference": {
          "rule": 7,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "The ball shall be put in play if Team A is ready or it shall be placed on the floor.",
        "ruleReference": {
          "rule": 7,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "The throw-in count shall begin and if a violation occurs, the procedure will be repeated for Team B.",
        "ruleReference": {
          "rule": 7,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "Following a violation by one team only, if that team continues to delay when authorized to make a throw-in, it is a technical foul.",
        "ruleReference": {
          "rule": 7,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "Following a violation by both teams, any further delay by either team is a technical foul.",
        "ruleReference": {
          "rule": 7,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "After an out-of-bounds violation in either the frontcourt or the backcourt by either team, the throw-in shall be at the designated spot nearest to where the ball went out of bounds.",
        "ruleReference": {
          "rule": 7,
          "section": 5,
          "article": 2
        }
      },
      {
        "text": "After a violation by either team, a foul by either team before the bonus is in effect or any other stoppage in play, the throw-in location will be determined by the location of the violation/foul or the location of the ball when the stoppage occurs.",
        "ruleReference": {
          "rule": 7,
          "section": 5,
          "article": 3
        }
      },
      {
        "text": "If the throw-in is to be in the team's frontcourt, it shall be at either the nearest 28-foot mark along each sideline or the nearest spot 3-feet outside the lane line along the end line.",
        "ruleReference": {
          "rule": 7,
          "section": 5,
          "article": 3
        }
      },
      {
        "text": "If the throw-in is to be in the team's backcourt, the throw-in shall be at the designated spot nearest to where the foul, violation or other stoppage in play occurred.",
        "ruleReference": {
          "rule": 7,
          "section": 5,
          "article": 3
        }
      },
      {
        "text": "Officials shall determine the designated spot by using an imaginary line drawn from the intersection of the end line with the sideline to each lane line where it intersects with the free-throw line including the semicircle.",
        "ruleReference": {
          "rule": 7,
          "section": 5,
          "article": 4
        }
      },
      {
        "text": "If the stoppage of play occurs inside the imaginary line, the designated spot shall be the nearest point on the end line 3-feet outside the lane line.",
        "ruleReference": {
          "rule": 7,
          "section": 5,
          "article": 4
        }
      },
      {
        "text": "If the stoppage occurs outside the imaginary line, the designated spot shall be the nearest sideline at the 28-foot line.",
        "ruleReference": {
          "rule": 7,
          "section": 5,
          "article": 4
        }
      },
      {
        "text": "Designated out-of-bounds spot throw-in behind the backboard shall be made from the nearer free-throw lane line extended.",
        "ruleReference": {
          "rule": 7,
          "section": 5,
          "article": 5
        }
      },
      {
        "text": "Designated out-of-bounds spot throw-in at the division line opposite the scorer's and timer's table shall occur after a technical foul, as in Rule 4-19-5.",
        "ruleReference": {
          "rule": 7,
          "section": 5,
          "article": 6
        }
      },
      {
        "text": "Any player of the team to whom the free throws have been awarded shall make the throw-in after a technical foul.",
        "ruleReference": {
          "rule": 7,
          "section": 5,
          "article": 6
        }
      },
      {
        "text": "For an alternating-possession throw-in to start the second, third and fourth quarters, any player from the team with the possession arrow shall make the throw-in.",
        "ruleReference": {
          "rule": 7,
          "section": 5,
          "article": 6
        }
      },
      {
        "text": "A throw-in anywhere along the end line after a goal or an awarded goal for basket interference or goaltending by a defensive player shall be made from the end of the court where the goal was made and from any point outside the end line.",
        "ruleReference": {
          "rule": 7,
          "section": 5,
          "article": 7
        }
      },
      {
        "text": "The team not credited with the score shall make a throw-in from the end of the court where the goal was made and from any point outside the end line after a goal or an awarded goal for basket interference or goaltending by a defensive player.",
        "ruleReference": {
          "rule": 7,
          "section": 5,
          "article": 7
        }
      },
      {
        "text": "Any player of the team may make a direct throw-in or may pass the ball along the end line to a teammate(s) outside the boundary.",
        "ruleReference": {
          "rule": 7,
          "section": 5,
          "article": 7
        }
      },
      {
        "text": "A team retains the privilege of a throw-in if the scoring team commits a violation or common foul before the throw-in ends and before the bonus rule is in effect and the ensuing throw-in spot would have been on the end line.",
        "ruleReference": {
          "rule": 7,
          "section": 5,
          "article": 7
        }
      },
      {
        "text": "The official shall hand or bounce the ball to the thrower for a throw-in unless the throw-in is from outside an end line following a successful goal.",
        "ruleReference": {
          "rule": 7,
          "section": 6,
          "article": 1
        }
      },
      {
        "text": "The throw-in begins when the ball is at the disposal of a player of the team entitled to the throw-in.",
        "ruleReference": {
          "rule": 7,
          "section": 6,
          "article": 2
        }
      },
      {
        "text": "The thrower shall release the ball on a pass directly into the court, except as in Rule 7-5-7, within five seconds after the throw-in begins.",
        "ruleReference": {
          "rule": 7,
          "section": 6,
          "article": 2
        }
      },
      {
        "text": "The throw-in pass shall touch another player (inbounds or out of bounds) on the court before going out of bounds untouched.",
        "ruleReference": {
          "rule": 7,
          "section": 6,
          "article": 2
        }
      },
      {
        "text": "The throw-in pass shall not touch a teammate while it is on the out-of-bounds side of the throw-in boundary plane.",
        "ruleReference": {
          "rule": 7,
          "section": 6,
          "article": 2
        }
      },
      {
        "text": "The thrower shall not leave the designated throw-in spot until the ball has been released on a throw-in pass.",
        "ruleReference": {
          "rule": 7,
          "section": 6,
          "article": 3
        }
      },
      {
        "text": "The opponent(s) of the thrower shall not have any body part through the inbounds side of the throw-in boundary plane until the ball has been released on a throw-in pass.",
        "ruleReference": {
          "rule": 7,
          "section": 6,
          "article": 4
        }
      },
      {
        "text": "The thrower shall have a minimum of 3 feet horizontally from the opponent(s) as in Rule 1-2-2.",
        "ruleReference": {
          "rule": 7,
          "section": 6,
          "article": 4
        }
      },
      {
        "text": "If the court is not marked accordingly, an imaginary restraining line shall be imposed by the administering official.",
        "ruleReference": {
          "rule": 7,
          "section": 6,
          "article": 4
        }
      },
      {
        "text": "Teammates shall not occupy adjacent positions which are parallel to and within 3 feet of the boundary line if an opponent desires one of the positions.",
        "ruleReference": {
          "rule": 7,
          "section": 6,
          "article": 5
        }
      },
      {
        "text": "The 3-foot restraining line is sometimes the temporary boundary line as in Rule 1-2-2.",
        "ruleReference": {
          "rule": 7,
          "section": 6,
          "article": 5
        }
      },
      {
        "text": "When an official administers a throw-in to the wrong team, the mistake shall be rectified before the first dead ball after the ball becomes live unless there has been a change of possession.",
        "ruleReference": {
          "rule": 7,
          "section": 6,
          "article": 6
        }
      }
    ]
  },
  {
    "ruleNumber": 8,
    "sentences": [
      {
        "text": "When a free throw is awarded, the ball shall be placed at the disposal of the free thrower by the administering official.",
        "ruleReference": {
          "rule": 8,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "The ball shall be bounced by the administering official.",
        "ruleReference": {
          "rule": 8,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "The free throw count shall begin when the ball is placed at the disposal of the free thrower.",
        "ruleReference": {
          "rule": 8,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "Either or both teams may be charged with a violation during the free throw process.",
        "ruleReference": {
          "rule": 8,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "Following a time-out or intermission, the resumption-of-play procedure may be used to prevent delay.",
        "ruleReference": {
          "rule": 8,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "The administering official shall sound the whistle to indicate play will resume.",
        "ruleReference": {
          "rule": 8,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "The ball shall be placed at the disposal of the thrower or placed on the floor at the free-throw line.",
        "ruleReference": {
          "rule": 8,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "The count shall begin when the ball is placed at the disposal of the thrower or on the floor at the free-throw line.",
        "ruleReference": {
          "rule": 8,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "Either or both teams may be charged with a violation following the resumption of play.",
        "ruleReference": {
          "rule": 8,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "If the offending team(s) continues to delay after a violation, a team technical foul shall be ruled.",
        "ruleReference": {
          "rule": 8,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "If the ball is to become dead when the last free throw for a specific penalty is not successful, players shall not occupy any spaces along the free-throw lane lines.",
        "ruleReference": {
          "rule": 8,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "During a free throw, lane spaces may be occupied as follows:",
        "ruleReference": {
          "rule": 8,
          "section": 1,
          "article": 4
        }
      },
      {
        "text": "Marked lane spaces may be occupied by a maximum of two offensive players.",
        "ruleReference": {
          "rule": 8,
          "section": 1,
          "article": 4
        }
      },
      {
        "text": "Four defensive players may occupy lane spaces during a free throw.",
        "ruleReference": {
          "rule": 8,
          "section": 1,
          "article": 4
        }
      },
      {
        "text": "The first marked lane spaces on each side of the lane shall be occupied by opponents of the free thrower.",
        "ruleReference": {
          "rule": 8,
          "section": 1,
          "article": 4
        }
      },
      {
        "text": "No teammate of the free thrower shall occupy either of the first marked lane spaces.",
        "ruleReference": {
          "rule": 8,
          "section": 1,
          "article": 4
        }
      },
      {
        "text": "The second marked lane spaces on each side may be occupied by teammates of the free thrower.",
        "ruleReference": {
          "rule": 8,
          "section": 1,
          "article": 4
        }
      },
      {
        "text": "The third marked lane spaces on each side, nearest the free thrower, may be occupied by the opponents of the free thrower.",
        "ruleReference": {
          "rule": 8,
          "section": 1,
          "article": 4
        }
      },
      {
        "text": "Players shall be permitted to move along and across the lane to occupy a vacant marked lane space within the limitations listed in this rule.",
        "ruleReference": {
          "rule": 8,
          "section": 1,
          "article": 4
        }
      },
      {
        "text": "Not more than one player may occupy any part of a marked lane space during a free throw.",
        "ruleReference": {
          "rule": 8,
          "section": 1,
          "article": 4
        }
      },
      {
        "text": "Any player, other than the free thrower, who does not occupy a marked lane space shall be behind the free-throw line extended and behind the three-point line.",
        "ruleReference": {
          "rule": 8,
          "section": 1,
          "article": 5
        }
      },
      {
        "text": "The free throw(s) awarded because of a personal foul shall be attempted by the offended player.",
        "ruleReference": {
          "rule": 8,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "If the offended player withdraws because of an injury or disqualification, the offended player's substitute shall attempt the throw(s).",
        "ruleReference": {
          "rule": 8,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "If no substitute is available, any teammate may attempt the throw(s) as selected by the team captain or head coach.",
        "ruleReference": {
          "rule": 8,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "The free throws awarded because of a technical foul may be attempted by any player of the offended team.",
        "ruleReference": {
          "rule": 8,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "The free throw(s) may include an eligible substitute or designated starter.",
        "ruleReference": {
          "rule": 8,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "The coach or captain shall designate the free thrower(s) for technical fouls.",
        "ruleReference": {
          "rule": 8,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "The try for goal shall be made within 10 seconds after the ball has been placed at the disposal of the free thrower at the free-throw line.",
        "ruleReference": {
          "rule": 8,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "This 10-second limit shall apply to each free throw.",
        "ruleReference": {
          "rule": 8,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "After a free throw which is not followed by another free throw, the ball shall be put in play by a throw-in.",
        "ruleReference": {
          "rule": 8,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "If the try is for a personal foul other than intentional or flagrant, and is successful, the ball shall be put in play as after a field goal.",
        "ruleReference": {
          "rule": 8,
          "section": 5,
          "article": 2
        }
      },
      {
        "text": "If the free throw is for a technical foul, the ball shall be put in play by any player of the free-thrower's team from out of bounds at the division line on the side opposite the scorer's and timer's table.",
        "ruleReference": {
          "rule": 8,
          "section": 5,
          "article": 3
        }
      },
      {
        "text": "If the free throw is for an intentional personal foul or flagrant personal foul, the ball shall be put in play by any player of the free-thrower's team from the out-of-bounds spot nearest the foul.",
        "ruleReference": {
          "rule": 8,
          "section": 5,
          "article": 3
        }
      },
      {
        "text": "If a free throw for a personal foul, other than intentional or flagrant, is unsuccessful, the ball remains live.",
        "ruleReference": {
          "rule": 8,
          "section": 6,
          "article": 1
        }
      },
      {
        "text": "If there is a multiple throw for a personal foul(s) and the last free throw is unsuccessful, the ball remains live.",
        "ruleReference": {
          "rule": 8,
          "section": 6,
          "article": 1
        }
      },
      {
        "text": "If there is a multiple throw and both a single personal and single technical foul are involved, the tries shall be attempted in the order in which the related fouls occurred.",
        "ruleReference": {
          "rule": 8,
          "section": 6,
          "article": 2
        }
      },
      {
        "text": "If the last try is for a single technical foul, or intentional or flagrant personal foul, the ball shall be put in play by a throw-in.",
        "ruleReference": {
          "rule": 8,
          "section": 6,
          "article": 2
        }
      },
      {
        "text": "If a false double foul involves any type of single foul and any type of double or simultaneous foul, play is resumed with the penalty for only the single foul.",
        "ruleReference": {
          "rule": 8,
          "section": 6,
          "article": 3
        }
      }
    ]
  },
  {
    "ruleNumber": 9,
    "sentences": [
      {
        "text": "The try shall be attempted from within the free-throw semicircle and behind the free-throw line.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 1
        }
      },
      {
        "text": "Teams shall properly occupy marked lane spaces according to number and space requirements.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 2
        }
      },
      {
        "text": "After the ball is placed at the disposal of a free thrower, the free thrower shall throw within 10 seconds to cause the ball to enter the basket or touch the ring before the free throw ends.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "After the ball is placed at the disposal of a free thrower, the free thrower shall not fake a try.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "After the ball is placed at the disposal of a free thrower, no player in a marked lane space shall fake to cause an opponent to violate.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "No opponent shall distract the free thrower.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "No player shall enter a marked lane space or leave a marked lane space by contacting the court outside the 36-inch by 36-inch space until the ball is released.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "The free thrower shall not have either foot beyond the vertical plane of the edge of the free-throw line which is farther from the basket or the free-throw semicircle line until the ball touches the ring or until the free throw ends.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "A player, other than the free thrower, who does not occupy a marked lane space, may not have either foot beyond the vertical plane of the free-throw line extended and the three-point line which is farther from the basket until the ball touches the ring or until the free throw ends.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "A player occupying a marked lane space may not have either foot beyond the vertical plane of the outside edge of any lane boundary, or beyond the vertical plane of any edge of the space designated by lane-space marks.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "A player shall position one foot near the outer edge of the free-throw lane line.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "The other foot of a player occupying a marked lane space may be positioned anywhere within the designated 36-inch lane space until the ball has been released.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "Players occupying marked free-throw lane lines spaces may not enter the free-throw semicircle until the ball touches the ring or until the free throw ends.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "If the first or only violation is by the free thrower or a teammate, the ball becomes dead when the violation occurs, and no point can be scored by that throw.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "If the violation occurs during a free throw for a personal foul, other than intentional or flagrant, the ball is awarded to the opponents for a throw-in from the designated out-of-bounds spot nearest the violation.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "If the violation occurs during a free throw for a technical foul, the ball is awarded to the thrower's team for a throw-in at the division line on the side of the court opposite the scorer's and timer's table.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "If the violation occurs during a free throw for a flagrant personal foul or an intentional personal foul, the ball is awarded to the thrower's team for a throw-in from the designated out-of-bounds spot nearest the foul.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "If the violation is by the free-thrower's opponent only, and if the try is successful, the goal counts and the violation is disregarded.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "If the violation is by the free-thrower's opponent only, and if the try is not successful, the ball becomes dead when the free throw ends, and a substitute throw shall be attempted by the same free thrower under the same conditions as for the free throw for which it is substituted.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "If there is a simultaneous violation by each team, the ball becomes dead and no point can be scored.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "If the free thrower's team retains possession after a simultaneous violation, the throw-in will be at one of the four designated spots nearest the simultaneous violation.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "If the opponent gains possession after a simultaneous violation, the throw-in will be at the spot nearest the simultaneous violation.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "If there is a violation first by the free-thrower's opponent followed by the free thrower or a teammate, and if both offenders are in a marked lane-space, the second violation is ignored.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "If there is a violation first by the free-thrower's opponent followed by the free thrower or a teammate, and if the second violation is by the free thrower or a teammate behind the free-throw line extended and/or the three-point line, both violations are penalized.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "If a violation by the free thrower follows distraction by an opponent, a substitute free throw shall be awarded.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "If a fake by an opponent causes the free thrower or a teammate of the free thrower to violate, only the fake is penalized.",
        "ruleReference": {
          "rule": 9,
          "section": 1,
          "article": 3
        }
      },
      {
        "text": "The thrower shall not leave the designated throw-in spot until the ball has been released on a throw-in pass.",
        "ruleReference": {
          "rule": 9,
          "section": 2,
          "article": 1
        }
      },
      {
        "text": "The ball shall be passed by the thrower directly into the court from out-of-bounds so it touches or is touched by another player on the court before going out of bounds untouched.",
        "ruleReference": {
          "rule": 9,
          "section": 2,
          "article": 2
        }
      },
      {
        "text": "The thrown ball shall not be touched by a teammate of the thrower while the ball is on the out-of-bounds side of the throw-in boundary-line plane, except as in Rule 7-5-7.",
        "ruleReference": {
          "rule": 9,
          "section": 2,
          "article": 3
        }
      },
      {
        "text": "Once the throw-in starts, the ball shall be released on a pass directly into the court before five seconds have elapsed.",
        "ruleReference": {
          "rule": 9,
          "section": 2,
          "article": 4
        }
      },
      {
        "text": "The thrower shall not carry the ball onto the court.",
        "ruleReference": {
          "rule": 9,
          "section": 2,
          "article": 5
        }
      },
      {
        "text": "The thrown ball shall not touch the thrower in the court before it touches or is touched by another player.",
        "ruleReference": {
          "rule": 9,
          "section": 2,
          "article": 6
        }
      },
      {
        "text": "The thrown ball shall not enter the basket before it touches or is touched by another player.",
        "ruleReference": {
          "rule": 9,
          "section": 2,
          "article": 7
        }
      },
      {
        "text": "The thrown ball shall not become lodged between the backboard and ring or come to rest on the flange before it touches or is touched by another player.",
        "ruleReference": {
          "rule": 9,
          "section": 2,
          "article": 8
        }
      },
      {
        "text": "The thrower shall not be replaced by a teammate after the ball is at the thrower's disposal, except as in Rule 7-5-7.",
        "ruleReference": {
          "rule": 9,
          "section": 2,
          "article": 9
        }
      },
      {
        "text": "The opponent(s) of the thrower shall not have any body part through the inbounds side of the throw-in boundary-line plane until the ball has been released on a throw-in pass.",
        "ruleReference": {
          "rule": 9,
          "section": 2,
          "article": 10
        }
      },
      {
        "text": "The thrower may penetrate the plane provided the thrower does not touch the inbounds area or a player inbounds before the ball is released on the throw-in pass.",
        "ruleReference": {
          "rule": 9,
          "section": 2,
          "article": 10
        }
      },
      {
        "text": "The opponent in this situation may legally touch or grasp the ball.",
        "ruleReference": {
          "rule": 9,
          "section": 2,
          "article": 10
        }
      },
      {
        "text": "The first violation of the throw-in boundary-line plane by an opponent(s) of the thrower shall result in a team warning for delay being given.",
        "ruleReference": {
          "rule": 9,
          "section": 2,
          "article": 10
        }
      },
      {
        "text": "The warning for delay does not result in the loss of the opportunity to move along the end line when and if applicable.",
        "ruleReference": {
          "rule": 9,
          "section": 2,
          "article": 10
        }
      },
      {
        "text": "The second or additional violations will result in a technical foul assessed to the offending team.",
        "ruleReference": {
          "rule": 9,
          "section": 2,
          "article": 10
        }
      },
      {
        "text": "If an opponent(s) reaches through the throw-in boundary-line plane and touches or dislodges the ball while in possession of the thrower or being passed to a teammate outside the boundary line, a technical foul shall be charged to the offender.",
        "ruleReference": {
          "rule": 9,
          "section": 2,
          "article": 10
        }
      },
      {
        "text": "If an opponent(s) contacts the thrower, an intentional personal foul shall be charged to the offender.",
        "ruleReference": {
          "rule": 9,
          "section": 2,
          "article": 10
        }
      },
      {
        "text": "No teammate of the thrower shall be out of bounds after a designated-spot throw-in begins.",
        "ruleReference": {
          "rule": 9,
          "section": 2,
          "article": 11
        }
      },
      {
        "text": "The ball becomes dead when the violation or technical foul occurs after a designated-spot throw-in begins.",
        "ruleReference": {
          "rule": 9,
          "section": 2,
          "article": 11
        }
      },
      {
        "text": "Following a violation after a designated-spot throw-in begins, the ball is awarded to the opponents for a throw-in at the original throw-in spot.",
        "ruleReference": {
          "rule": 9,
          "section": 2,
          "article": 11
        }
      },
      {
        "text": "A player shall not cause the ball to go out of bounds.",
        "ruleReference": {
          "rule": 9,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "The dribbler has committed a violation if the dribbler steps on or outside a boundary, even though the dribbler is not touching the ball while the dribbler is out of bounds.",
        "ruleReference": {
          "rule": 9,
          "section": 3,
          "article": 1
        }
      },
      {
        "text": "A player shall not be out of bounds when a player touches or is touched by the ball after it has been released on a throw-in pass.",
        "ruleReference": {
          "rule": 9,
          "section": 3,
          "article": 2
        }
      },
      {
        "text": "A player shall not step out of bounds under the player's own volition and then become the first player to touch the ball after returning to the playing court or to avoid a violation.",
        "ruleReference": {
          "rule": 9,
          "section": 3,
          "article": 3
        }
      },
      {
        "text": "The ball is dead when the violation occurs and is awarded to the opponents for a throw-in from the designated out-of-bounds spot nearest the violation.",
        "ruleReference": {
          "rule": 9,
          "section": 3,
          "article": 3
        }
      },
      {
        "text": "A player shall not travel with the ball, as in Rule 4-44.",
        "ruleReference": {
          "rule": 9,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "A player shall not intentionally kick the ball, as in Rule 4-29.",
        "ruleReference": {
          "rule": 9,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "A player shall not strike the ball with the fist or cause it to enter and pass through the basket from below.",
        "ruleReference": {
          "rule": 9,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "Kicking the ball is a violation only when it is an intentional act; accidentally striking the ball with the foot or leg is not a violation.",
        "ruleReference": {
          "rule": 9,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "The ball is dead when the violation occurs in Section 4.",
        "ruleReference": {
          "rule": 9,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "When the opponent is awarded possession in their frontcourt, the throw-in will be at one of the four designated spots nearest the violation.",
        "ruleReference": {
          "rule": 9,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "When the opponent is awarded possession in their backcourt, the throw-in will be from the designated out-of-bounds spot nearest the violation.",
        "ruleReference": {
          "rule": 9,
          "section": 4,
          "article": 1
        }
      },
      {
        "text": "A player shall not dribble a second time after the player's first dribble has ended, unless it is after the player has lost control because of a try for field goal.",
        "ruleReference": {
          "rule": 9,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "A player shall not dribble a second time after the player's first dribble has ended, unless it is after the player has lost control because of a touch by an opponent.",
        "ruleReference": {
          "rule": 9,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "A player shall not dribble a second time after the player's first dribble has ended, unless it is after the player has lost control because of a pass or fumble which has then touched, or been touched by, another player.",
        "ruleReference": {
          "rule": 9,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "The ball is dead when the violation occurs in Section 5.",
        "ruleReference": {
          "rule": 9,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "When the opponent is awarded possession in their frontcourt, the throw-in will be at one of the four designated spots nearest the violation.",
        "ruleReference": {
          "rule": 9,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "When the opponent is awarded possession in their backcourt, the throw-in will be from the designated out-of-bounds spot nearest the violation.",
        "ruleReference": {
          "rule": 9,
          "section": 5,
          "article": 1
        }
      },
      {
        "text": "A player shall not violate any provision of the jump ball.",
        "ruleReference": {
          "rule": 9,
          "section": 6,
          "article": 1
        }
      },
      {
        "text": "If both teams simultaneously commit violations during the jump ball or if the official makes a bad toss, the toss shall be repeated.",
        "ruleReference": {
          "rule": 9,
          "section": 6,
          "article": 1
        }
      },
      {
        "text": "The ball is dead when the violation occurs in Section 6.",
        "ruleReference": {
          "rule": 9,
          "section": 6,
          "article": 1
        }
      },
      {
        "text": "When the opponent is awarded possession in their frontcourt, the throw-in will be at one of the four designated spots nearest the violation.",
        "ruleReference": {
          "rule": 9,
          "section": 6,
          "article": 1
        }
      },
      {
        "text": "When the opponent is awarded possession in their backcourt, the throw-in will be from the designated out-of-bounds spot nearest the violation.",
        "ruleReference": {
          "rule": 9,
          "section": 6,
          "article": 1
        }
      },
      {
        "text": "A player shall not remain for three seconds in that part of the player's free-throw lane between the end line and the farther edge of the free-throw line while the ball is in control of the player's team in the team's frontcourt.",
        "ruleReference": {
          "rule": 9,
          "section": 7,
          "article": 1
        }
      },
      {
        "text": "The three-second restriction applies to a player who has only one foot touching the lane boundary.",
        "ruleReference": {
          "rule": 9,
          "section": 7,
          "article": 2
        }
      },
      {
        "text": "Allowance shall be made for a player who, having been in the restricted area for less than three seconds, dribbles in or moves immediately to try for field goal.",
        "ruleReference": {
          "rule": 9,
          "section": 7,
          "article": 3
        }
      },
      {
        "text": "The ball is dead when the violation occurs in Section 7.",
        "ruleReference": {
          "rule": 9,
          "section": 7,
          "article": 3
        }
      },
      {
        "text": "The opponent is awarded a possession throw-in in its frontcourt at one of the four designated spots nearest the violation.",
        "ruleReference": {
          "rule": 9,
          "section": 7,
          "article": 3
        }
      },
      {
        "text": "A player shall not be, nor may the player's team be, in continuous control of the ball which is in the team's backcourt for 10 seconds.",
        "ruleReference": {
          "rule": 9,
          "section": 8,
          "article": 1
        }
      },
      {
        "text": "The ball is dead when the violation occurs in Section 8.",
        "ruleReference": {
          "rule": 9,
          "section": 8,
          "article": 1
        }
      },
      {
        "text": "The opponent is awarded a possession throw-in in its frontcourt at one of the four designated spots nearest the violation.",
        "ruleReference": {
          "rule": 9,
          "section": 8,
          "article": 1
        }
      },
      {
        "text": "A player shall not be the first to touch the ball after it has been in team control in the frontcourt, if the player or a teammate last touched or was touched by the ball in the frontcourt before it went to the backcourt.",
        "ruleReference": {
          "rule": 9,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "A ball in team control of Team A in the frontcourt that is deflected by a defensive player, which causes the ball to go into the backcourt, may be recovered by either team unless the offense was the last to touch the ball before it went into the backcourt.",
        "ruleReference": {
          "rule": 9,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "If the offense was last to touch the ball in its frontcourt, only the defense can legally recover the basketball.",
        "ruleReference": {
          "rule": 9,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "While in player and team control in its backcourt, a player shall not cause the ball to go from backcourt to frontcourt and return to backcourt, without the ball touching a player in the frontcourt, such that the player or a teammate is the first to touch it in the backcourt.",
        "ruleReference": {
          "rule": 9,
          "section": 9,
          "article": 2
        }
      },
      {
        "text": "During a jump ball, throw-in or while on defense, a player may legally jump from the player's frontcourt, secure control of the ball with both feet off the floor and return to the floor with one or both feet in the backcourt.",
        "ruleReference": {
          "rule": 9,
          "section": 9,
          "article": 3
        }
      },
      {
        "text": "The player may make a normal landing and it makes no difference whether the first foot down is in the frontcourt or backcourt.",
        "ruleReference": {
          "rule": 9,
          "section": 9,
          "article": 3
        }
      },
      {
        "text": "The ball is dead when the violation occurs in Section 9.",
        "ruleReference": {
          "rule": 9,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "The opponent is awarded a possession throw-in in its frontcourt at one of the four designated spots nearest the violation.",
        "ruleReference": {
          "rule": 9,
          "section": 9,
          "article": 1
        }
      },
      {
        "text": "A player shall not, while closely guarded, hold the ball for five seconds or dribble the ball for five seconds in the team's frontcourt.",
        "ruleReference": {
          "rule": 9,
          "section": 10,
          "article": 1
        }
      },
      {
        "text": "A player shall not, while closely guarded, control the ball for five seconds in an area enclosed by screening teammates in the team's frontcourt.",
        "ruleReference": {
          "rule": 9,
          "section": 10,
          "article": 1
        }
      },
      {
        "text": "A closely guarded count shall not be started during an interrupted dribble.",
        "ruleReference": {
          "rule": 9,
          "section": 10,
          "article": 2
        }
      },
      {
        "text": "A closely guarded count shall be terminated during an interrupted dribble.",
        "ruleReference": {
          "rule": 9,
          "section": 10,
          "article": 3
        }
      },
      {
        "text": "The ball is dead when the violation occurs in Section 10.",
        "ruleReference": {
          "rule": 9,
          "section": 10,
          "article": 1
        }
      },
      {
        "text": "The ball is awarded to the opponent for a throw-in from the designated out-of-bounds spot nearest the violation in Section 10.",
        "ruleReference": {
          "rule": 9,
          "section": 10,
          "article": 1
        }
      },
      {
        "text": "A player shall not commit basket interference as in Rule 4-6.",
        "ruleReference": {
          "rule": 9,
          "section": 11,
          "article": 1
        }
      },
      {
        "text": "A player shall not commit goaltending as in Rule 4-22.",
        "ruleReference": {
          "rule": 9,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "If the violation is at the opponent's basket, the opponents are awarded one point if during a free throw, three points if during a three-point try and two points in any other case.",
        "ruleReference": {
          "rule": 9,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "The crediting of the score and subsequent procedure are the same as if the awarded score had resulted from the ball having gone into the basket, except that the official shall hand or bounce the ball to a player of the team entitled to the throw-in.",
        "ruleReference": {
          "rule": 9,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "If the violation is at a team's own basket, no points can be scored, and the ball is awarded to the opponents for a throw-in from the designated out-of-bounds spot nearest the violation.",
        "ruleReference": {
          "rule": 9,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "If the violation results from touching the ball while it is in the basket after entering from below, no points are scored.",
        "ruleReference": {
          "rule": 9,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "If the defensive team commits the violation, the opponent is awarded a possession throw-in in its frontcourt at one of the four designated spots nearest the violation.",
        "ruleReference": {
          "rule": 9,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "If the offensive team commits the violation, the opponent is awarded a possession throw-in in its backcourt from the designated out-of-bounds spot nearest the violation.",
        "ruleReference": {
          "rule": 9,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "If there is a violation by both teams, play shall be resumed by the team entitled to the alternating-possession throw-in.",
        "ruleReference": {
          "rule": 9,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "If the offensive team retains possession, it is awarded a possession throw-in in its frontcourt at one of the four designated spots nearest the violation.",
        "ruleReference": {
          "rule": 9,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "If the defensive team gains possession, it is awarded a possession throw-in in its backcourt from the designated out-of-bounds spot nearest the violation.",
        "ruleReference": {
          "rule": 9,
          "section": 12,
          "article": 1
        }
      },
      {
        "text": "A player shall not excessively swing a player's own arms(s) or elbow(s), even without contacting an opponent.",
        "ruleReference": {
          "rule": 9,
          "section": 13,
          "article": 1
        }
      },
      {
        "text": "A player may extend arm(s) or elbow(s) to hold the ball under the chin or against the body.",
        "ruleReference": {
          "rule": 9,
          "section": 13,
          "article": 2
        }
      },
      {
        "text": "Action of arm(s) and elbow(s) resulting from total body movements as in pivoting or movement of the ball incidental to feinting with it, releasing it, or moving it to prevent a held ball or loss of control shall not be considered excessive.",
        "ruleReference": {
          "rule": 9,
          "section": 13,
          "article": 3
        }
      },
      {
        "text": "The ball is dead when the violation occurs in Section 13.",
        "ruleReference": {
          "rule": 9,
          "section": 13,
          "article": 1
        }
      },
      {
        "text": "When the opponent is awarded possession in its frontcourt, the throw-in will be at one of the four designated spots nearest the violation.",
        "ruleReference": {
          "rule": 9,
          "section": 13,
          "article": 1
        }
      },
      {
        "text": "When the opponent is awarded possession in its backcourt, the throw-in will be from the designated out-of-bounds spot nearest the violation.",
        "ruleReference": {
          "rule": 9,
          "section": 13,
          "article": 1
        }
      }
    ]
  }
]